MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_hash.c
  * @brief   HASH HAL module driver.
  *          This file provides firmware functions to manage HASH peripheral
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */

#if defined (HASH)
#if defined (USE_HAL_HASH_MODULE) && (USE_HAL_HASH_MODULE == 1)

/** @addtogroup HASH
  * @{
  */
/** @defgroup HASH_Introduction HASH Introduction
  * @{

   The HASH hardware abstraction layer provides a set of APIs to configure and control the HASH peripheral
   on STM32 microcontrollers.

   HMAC is suitable for applications requiring message authentication.

   The HASH processor computes FIPS (Federal Information Processing Standards) approved digests of length of 160, 224,
   256 bits, for messages of any length less than 264 bits (for SHA-1, SHA-224 and SHA-256) or less than 2128 bits
   (for SHA-384, SHA-512).


  */
/**
  * @}
  */

/** @defgroup HASH_How_To_Use HASH How To Use
  * @{

# How to use this driver
The HASH HAL driver can be used as follows:

1. Initialize and de-initialize the logical HASH object :
  - To initialize the HASH peripheral, use the HAL_HASH_Init() function to initialize the HAL HASH driver for the given
    handle object
    - The HAL_HASH_Init() API allows you to associate physical instance to logical object(handle) and
      initialize the internal parameters of the handle.

    - The HAL_HASH_Init() API allows to enable the peripheral clock when USE_HASH_CLK_ENABLE_MODEL is different from
      HAL_CLK_ENABLE_NO. In case of the USE_HASH_CLK_ENABLE_MODEL compilation is not defined or define to
      HAL_CLK_ENABLE_NO, the application needs to explicitly call the HAL RCC API HAL_RCC_HASH_EnableClock() in order
      to enable the clock for the HASH peripheral.

  - To de-initialize the HASH peripheral, use the HAL_HASH_DeInit() function that stops any ongoing process and
    sets the HASH handle state to reset.

2. Set and Get HASH configuration:
 - To apply the HASH peripheral configuration, use the HAL_HASH_SetConfig().
   HASH Parameters are :
      - Data Swapping : no swap or half word swap or bit swap or byte swap.
      - algorithm : SHA-1, SHA2-224, SHA2-256, and on some supported
                    devices SHA2-384, SHA2-512224, SHA2-512256 and SHA2-512.
 - To get the HASH peripheral configuration, use the HAL_HASH_GetConfig() to retrieve the current HASH configuration.

3. Set and Get HASH HMAC configuration:
 - To apply the HASH HMAC peripheral configuration, use the HAL_HASH_HMAC_SetConfig().
   HASH HMAC Parameters are :
      - Data Swapping : no swap or half word swap or bit swap or byte swap.
      - algorithm : SHA-1, SHA2-224, SHA2-256, and on some supported
                    devices SHA2-384, SHA2-512224, SHA2-512256 and SHA2-512.
      - Key : Identifier of the key to use for the HMAC operation.
      - key size in bytes.
 - To get the HASH HMAC peripheral configuration, use the HAL_HASH_HMAC_GetConfig() to retrieve the current HASH HMAC
   configuration.

4. There are 2 families of API:
  - OneShot API: handling one single/complete buffer and providing the HASH result.
  - Update APIs: allowing the user to update several buffers then provide the HASH result corresponding
    to the data provided by the sum of these updated buffers.

5. Three processing modes are available:
 - OneShot APIs:
   - Polling mode: Processing APIs are blocking functions.
    These APIs process the data and wait until the digest computation is finished.
    Use the function HAL_HASH_Compute() for HASH or HAL_HASH_HMAC_Compute() for HMAC.
   - Interrupt mode: processing APIs are not blocking functions.
     It processes the data in interrupt mode
     Use the function HAL_HASH_Compute_IT() for HASH or HAL_HASH_HMAC_Compute_IT() for HMAC.
   - DMA mode: processing APIs are not blocking functions and the CPU is not used for data transfer.
     The data transfer is ensured by DMA.
     Use the function HAL_HASH_Compute_DMA() for HASH or HAL_HASH_HMAC_Compute_DMA() for HMAC.

 - Update APIs:
   - Polling mode:
     - HASH context mode :
       API HAL_HASH_Update() must be called to start hashing and update several input buffers.
      Call HAL_HASH_Finish() to retrieve the computed digest.
     - HMAC context mode :
       The key and the key size are entered in config API HAL_HASH_HMAC_SetConfig().
       API HAL_HASH_HMAC_Update() must be called to start hashing and update several input buffers.
      Call HAL_HASH_HMAC_Finish() to retrieve the computed digest.

   - Interrupt mode:
     - HASH context mode :
       API HAL_HASH_Update_IT() must be called to start hashing and update several input buffers.
      Call HAL_HASH_Finish() to retrieve the computed digest.

     - HMAC context mode :
       The key and the key size are entered in config API HAL_HASH_HMAC_SetConfig().
       API HAL_HASH_HMAC_Update_IT() must be called to start hashing and update several input buffers.
      Call HAL_HASH_HMAC_Finish() to retrieve the computed digest.

   - DMA mode:
     - HASH context mode :
       API HAL_HASH_Update_DMA() must be called to start hashing and update several input buffers.
      Call HAL_HASH_Finish() to retrieve the computed digest.
     - HMAC context mode :
       The key and the key size are entered in config API HAL_HASH_HMAC_SetConfig().
       API HAL_HASH_HMAC_Update_DMA() must be called to start hashing and update several input buffers.
      Call HAL_HASH_HMAC_Finish() to retrieve the computed digest.

