MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
6. Switch context:
 - Two APIs are available to suspend HASH or HMAC processing:
  - For computation process : Call the function HAL_HASH_RequestSuspendComputation()
     when a computation process is ongoing.
  - For update process: Call the function HAL_HASH_RequestSuspendUpdate() when an
     update process is ongoing.
 - Two APIs are available to resume HASH or HMAC processing:
  - For computation process : Call the function HAL_HASH_ResumeComputation() to resume the prior
     computation process and set the HAL HASH handle state to HAL_HASH_STATE_ACTIVE_COMPUTE.
  - For update process: Call the function HAL_HASH_ResumeUpdate() to resume the prior
     update process and set the HAL HASH handle state to HAL_HASH_STATE_ACTIVE_UPDATE.

 - When HASH or HMAC processing is suspended, the user can use the function HAL_HASH_SaveContext() to save the
   peripheral context. This context can be restored afterwards.
 - Before resuming the HASH or HMAC processing user can call HAL_HASH_RestoreContext() to restore the saved context
   needed if the HASH peripheral was used by another applicative process to perform some other hashing tasks.

 - Once the HASH Peripheral context has been restored to the same configuration as that at suspension time, processing
   can be resumed thanks to the APIs HAL_HASH_ResumeComputation()/HAL_HASH_ResumeUpdate() from the proper location
   reached at suspend time and with the same parameters (the required parameters to resume the operation are saved
   into the handle).

7. Remarks on message length:
 - HAL in interrupt mode (interrupt-driven):
    - Due to HASH peripheral hardware design, the peripheral interruption is triggered every 64 bytes.

 - HAL in DMA mode
    - Again, due to hardware design, the DMA transfer to feed the data can only be done on a word-basis.
      The same field described above in HASH_STR is used to specify which bits to discard at the end of the DMA
      transfer to process only the message bits and not extra bits. Due to hardware implementation,
      this is possible only at the end of the complete message. When several DMA transfers are needed to enter the
      message, this is not applicable at the end of the intermediary transfers.

8. Callback registration:
  - By default, after the HAL_HASH_Init, all callbacks are reset to the corresponding legacy weak functions:
     - HAL_HASH_InputCpltCallback()  : A Callback when an input data transfer complete has occurred.
     - HAL_HASH_DigestCpltCallback() : A Callback when a digest computation complete has occurred.
     - HAL_HASH_ErrorCallback()      : A Callback when an error has occurred.
     - HAL_HASH_SuspendCallback()    : A callback when a suspend operation has occurred.
     - HAL_HASH_AbortCallback()      : A callback when an abort operation has occurred.
  - The compilation define USE_HAL_HASH_REGISTER_CALLBACKS when set to 1 allows the user to configure dynamically
    the driver callbacks.
  - Use the function HAL_HASH_RegisterInputCpltCallback() to register a user callback for input completion.
  - Use the function HAL_HASH_RegisterDigestComputationCpltCallback() to register a user callback for input completion.
  - Use the function HAL_HASH_RegisterErrorCpltCallback() to register a user callback for error callback.
  - Use the function HAL_HASH_RegisterSuspendCpltCallback() to register a user callback for suspend callback.
  - Use the function HAL_HASH_RegisterAbortCpltCallback() to register a user callback for abort callback.

  - When the compilation define USE_HAL_HASH_REGISTER_CALLBACKS is set to 0 or not defined, the callback registering
    feature is not available and weak (overridden) callbacks are used.
  */
/**
  * @}
  */

/** @defgroup HASH_Configuration_Table HASH Configuration Table
  * @{
## Configuration inside the HASH driver

Config defines                 | Description     |   Default value | Note
-------------------------------| --------------- |-----------------| ---------------------------------------------
PRODUCT                        | from IDE        |     NONE        | STM32C5XX
USE_ASSERT_DBG_PARAM           | from the IDE    |     NONE        | Allows you to use assert parameter checks.
USE_ASSERT_DBG_STATE           | from the IDE    |     NONE        | Allows you to use assert state checks.
USE_HAL_HASH_MODULE            | from hal_conf.h |      1          | Enable the HAL HASH module
USE_HAL_CHECK_PARAM            | from hal_conf.h |      0          | Allows you to use runtime parameter checks.
USE_HAL_HASH_REGISTER_CALLBACKS| from hal_conf.h |      0          | Allows to provide specific callback functions.
USE_HAL_HASH_GET_LAST_ERRORS   | from hal_conf.h |      0          | Allows you to get last error codes.
USE_HAL_HASH_USER_DATA         | from hal_conf.h |      0          | Allows to enable/disable user data.
USE_HAL_HASH_CLK_ENABLE_MODEL  | from hal_conf.h |HAL_CLK_ENABLE_NO| Allows to enable the clock model for the HASH.
USE_HAL_HASH_DMA               | from hal_conf.h |      1          | Allows to enable the HASH DMA module service.
USE_HAL_SECURE_CHECK_PARAM     | from hal_conf.h |      0          | Allows to use the runtime check for sensitive APIs.
USE_HAL_CHECK_PROCESS_STATE    | from hal_conf.h |      0          | Allows to use the load and store exclusive
  */
/**
  * @}
  */

/* Private function prototypes --------------------------------------------------------------------------------------*/
/** @defgroup HASH_Private_Functions HASH Private Functions
  * @{
  */
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
static void HASH_ComputeDMAXferCplt(hal_dma_handle_t *hdma);
static void HASH_HMAC_ComputeDMAXferCplt(hal_dma_handle_t *hdma);
static void HASH_UpdateDMAXferCplt(hal_dma_handle_t *hdma);
static void HASH_HMAC_UpdateDMAXferCplt(hal_dma_handle_t *hdma);
static void HASH_DMAAbort(hal_dma_handle_t *hdma);
static void HASH_DMAError(hal_dma_handle_t *hdma);
static hal_status_t HASH_SuspendDMA(hal_hash_handle_t *hhash);
static hal_status_t HASH_ResumeDMA(hal_hash_handle_t *hhash);
#endif /* USE_HAL_HASH_DMA */

