MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
static void HASH_WriteKey(hal_hash_handle_t *hhash, const uint8_t *p_key, uint32_t key_size_byte);
static void HASH_GetDigestMsg(const hal_hash_handle_t *hhash, uint8_t *p_msg_digest, uint8_t input_size_byte);
static uint32_t HASH_GetDigestLength(hal_hash_algo_t algorithm);
static hal_status_t HASH_WaitUntilTimeout(hal_hash_handle_t *hhash, uint32_t timeout_ms, uint32_t tick_start);
static hal_status_t HASH_WaitOnFlag(hal_hash_handle_t *hhash, uint32_t flag, uint32_t flag_state,
                                    uint32_t timeout_ms);
static void HASH_SetHMACMode(const hal_hash_handle_t *hhash, uint32_t key_size_bytes);
static void HASH_WriteRemainingByte(hal_hash_handle_t *hhash, const uint8_t *p_in_buff, uint32_t input_size_bytes);
static void HASH_WriteBlock(hal_hash_handle_t *hhash);
static hal_status_t HASH_WriteBlock_IT(hal_hash_handle_t *hhash);
static hal_status_t HASH_WriteIncompleteBlock(hal_hash_handle_t *hhash, uint32_t nbr_remaining_words);
static void HASH_SaveRemainingBytes(hal_hash_handle_t *hhash, uint32_t remain_bytes_nbr);
static void HASH_AppendLastIncompleteWord(hal_hash_handle_t *hhash);
static hal_status_t HASH_WriteLastBlock(hal_hash_handle_t *hhash);
static hal_status_t HASH_HMAC_ComputeProcessData_IT(hal_hash_handle_t *hhash);
static hal_status_t HASH_HMAC_UpdateProcessData_IT(hal_hash_handle_t *hhash);
static void HASH_HMAC_SwitchToStep3(hal_hash_handle_t *hhash);
/**
  * @}
  */

/* Private constants ------------------------------------------------------------------------------------------------*/
/** @defgroup HASH_Private_Constants HASH Private Constants
  * @{
  */
#define HASH_MAX_BLOCK_PROCESS_CYCLE   (500U) /*!< Max block processing time in clock cycles        */

#define HAL_DIGEST_SIZE_20B            (20U)           /*!< Digest size in bytes of SHA1                      */
#define HAL_DIGEST_SIZE_28B            (28U)           /*!< Digest size in bytes of SHA224                    */
#define HAL_DIGEST_SIZE_32B            (32U)           /*!< Digest size in bytes of SHA256                    */
#if defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3)
#define HAL_DIGEST_SIZE_48B            (48U)           /*!< Digest size in bytes of SHA384                    */
#endif /* HASH_CR_ALGO_2 | HASH_CR_ALGO_3 */
#if defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3)
#define HAL_DIGEST_SIZE_64B            (64U)           /*!< Digest size in bytes of SHA512                    */
#endif /* HASH_CR_ALGO_2 | HASH_CR_ALGO_3 */

#define HASH_PHASE_READY                 (0x01U) /*!< HASH peripheral is ready to start                       */
#define HASH_PHASE_PROCESS               (0x02U) /*!< HASH peripheral is in HASH processing phase             */
#define HASH_PHASE_HMAC_MESSAGE_ENTRY    (0x03U) /*!< HASH peripheral is in HMAC step 2 processing phase
                                                      (It consists in entering the message text)              */
#define HASH_PHASE_HMAC_OUTER_KEY_ENTRY  (0x04U) /*!< HASH peripheral is in HMAC step 3 processing phase
                                                       (It consists in entering the outer hash function key)  */

#define HASH_WORD_SIZE_BYTE           (4U)      /*!< HASH peripheral transfers must be word-aligned (4 bytes) */
/**
  * @}
  */

/* Private macros --------------------------------------------------------------------------------------------------*/
/** @defgroup HASH_Private_Macros   HASH Private Macros
  * @{
  */
/*! Macro to get the handle instance */
#define HASH_GET_INSTANCE(handle)    ((HASH_TypeDef *)((uint32_t)(handle)->instance))

/*! Ensure that HASH input data type is valid */
#define IS_HASH_DATA_SWAPPING(data_swapping) (((data_swapping) == HAL_HASH_DATA_SWAP_NO)          \
                                              || ((data_swapping) == HAL_HASH_DATA_SWAP_HALFWORD) \
                                              || ((data_swapping) == HAL_HASH_DATA_SWAP_BYTE)     \
                                              || ((data_swapping) == HAL_HASH_DATA_SWAP_BIT))

/*! Ensure that HASH input algorithm is valid */
#if defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3)
#define IS_HASH_ALGORITHM(algorithm) (((algorithm) == HAL_HASH_ALGO_SHA1)         \
                                      || ((algorithm) == HAL_HASH_ALGO_SHA224)    \
                                      || ((algorithm) == HAL_HASH_ALGO_SHA256)    \
                                      || ((algorithm) == HAL_HASH_ALGO_SHA384)    \
                                      || ((algorithm) == HAL_HASH_ALGO_SHA512224) \
                                      || ((algorithm) == HAL_HASH_ALGO_SHA512256) \
                                      || ((algorithm) == HAL_HASH_ALGO_SHA512))
#else
#define IS_HASH_ALGORITHM(algorithm) (((algorithm) == HAL_HASH_ALGO_SHA1)      \
                                      || ((algorithm) == HAL_HASH_ALGO_SHA224) \
                                      || ((algorithm) == HAL_HASH_ALGO_SHA256))
#endif /* HASH_CR_ALGO_3 | HASH_CR_ALGO_2 */

/*! Ensure that HASH HMAC input algorithm is valid */
#if defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3)
#define IS_HASH_HMAC_ALGORITHM(algorithm) (((algorithm) == HAL_HASH_ALGO_SHA1)         \
                                           || ((algorithm) == HAL_HASH_ALGO_SHA224)    \
                                           || ((algorithm) == HAL_HASH_ALGO_SHA256)    \
                                           || ((algorithm) == HAL_HASH_ALGO_SHA384)    \
                                           || ((algorithm) == HAL_HASH_ALGO_SHA512224) \
                                           || ((algorithm) == HAL_HASH_ALGO_SHA512256) \
                                           || ((algorithm) == HAL_HASH_ALGO_SHA512))
#else
#define IS_HASH_HMAC_ALGORITHM(algorithm) (((algorithm) == HAL_HASH_ALGO_SHA1)      \
                                           || ((algorithm) == HAL_HASH_ALGO_SHA224) \
                                           || ((algorithm) == HAL_HASH_ALGO_SHA256))
#endif /* HASH_CR_ALGO_3 | HASH_CR_ALGO_2 */

/*! Checks if the output buffer size is valid for the given HASH/HMAC handle */
#define IS_OUT_BUFFER_SIZE_VALID(handle, size) ((size != 0U) && (size >= handle->digest_size_byte))
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup HASH_Exported_Functions
  * @{
  */
/** @addtogroup HASH_Exported_Functions_Group1
  * @{
This section provides functions allowing to:
- Initialize the HASH handle and associate it to a given HASH peripheral instance.
- DeInitialize the HASH peripheral.
  */
/**
  * @brief Initialize the selected HAL HASH handle and associate an HASH peripheral instance.
  * @param  hhash             Pointer to a hal_hash_handle_t structure.
  * @param  instance          HASH instance.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            HASH handle has been correctly initialized.
  */
hal_status_t HAL_HASH_Init(hal_hash_handle_t *hhash, hal_hash_t instance)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(IS_HASH_ALL_INSTANCE((HASH_TypeDef *)((uint32_t)instance)));

