MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

  /* Associate physical instance to logical object */
  hhash->instance = instance;

#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1U)
  hhash->hdma_in = (hal_dma_handle_t *)NULL;
#endif /* USE_HAL_HASH_DMA */

#if defined (USE_HAL_HASH_CLK_ENABLE_MODEL) && (USE_HAL_HASH_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  HAL_RCC_HASH_EnableClock();
#endif /* USE_HAL_HASH_CLK_ENABLE_MODEL */

#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_input_cplt_callback   = HAL_HASH_InputCpltCallback;
  hhash->p_digest_cplt_callback  = HAL_HASH_DigestCpltCallback;
  hhash->p_error_callback        = HAL_HASH_ErrorCallback;
  hhash->p_suspend_cplt_callback = HAL_HASH_SuspendCallback;
  hhash->p_abort_cplt_callback   = HAL_HASH_AbortCallback;
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */

#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
  hhash->last_error_codes = HAL_HASH_ERROR_NONE;
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */

#if defined(USE_HAL_HASH_USER_DATA) && (USE_HAL_HASH_USER_DATA == 1)
  hhash->p_user_data = NULL;
#endif /* USE_HAL_HASH_USER_DATA */

  hhash->global_state = HAL_HASH_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief DeInitialize the HASH peripheral.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  */
void HAL_HASH_DeInit(hal_hash_handle_t *hhash)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(IS_HASH_ALL_INSTANCE(HASH_GET_INSTANCE(hhash)));

#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  if ((hash_instance->CR & HASH_CR_DMAE) != 0U)
  {
    STM32_CLEAR_BIT(hash_instance->CR, HASH_CR_DMAE);

    (void)HAL_DMA_Abort(hhash->hdma_in);
  }
#endif /* USE_HAL_HASH_DMA */

  hhash->global_state = HAL_HASH_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group2
  * @{
This subsection provides a set of functions allowing to set and get the HASH configuration.
- Use the function HAL_HASH_SetConfig() to Configure HASH with the specified parameters in the hal_hash_config_t
  Parameters which are :
   - Data Swapping : no swap or half word swap or bit swap or byte swap.
   - algorithm : SHA-1, SHA2-224, SHA2-256, and on some supported
                    devices SHA2-384, SHA2-512224, SHA2-512256 and SHA2-512.
- Use the function HAL_HASH_GetConfig() to retrieve the HAL HASH configuration.
  */
/**
  * @brief Configure the HASH according to the specified parameters in the hal_hash_config_t.
  * @param  hhash             Pointer to a hal_hash_handle_t structure
  * @param  p_config          Pointer to a hal_hash_config_t structure that contains the configuration for HASH module.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            HASH instance has been correctly configured.
  */
hal_status_t HAL_HASH_SetConfig(hal_hash_handle_t *hhash, const hal_hash_config_t *p_config)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_HASH_DATA_SWAPPING(p_config->data_swapping));
  ASSERT_DBG_PARAM(IS_HASH_ALGORITHM(p_config->algorithm));

  ASSERT_DBG_STATE(hhash->global_state, ((uint32_t)HAL_HASH_STATE_INIT) | (uint32_t)HAL_HASH_STATE_CONFIGURED
                   | (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED);

#if (defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
     || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  STM32_CLEAR_BIT(hash_instance->CR, HASH_CR_LKEY);

  /* Set the data type and algorithm */
  STM32_MODIFY_REG(hash_instance->CR, HASH_CR_DATATYPE | HASH_CR_ALGO | HASH_CR_INIT,
                   ((uint32_t)p_config->data_swapping | (uint32_t)p_config->algorithm | HASH_CR_INIT));

  /* Get the digest size in bytes according to the selected algorithm */
  hhash->digest_size_byte = HASH_GetDigestLength(p_config->algorithm);

  /* Get the block size in bytes which can be deduced from the number of expected words returned by NBWE bits */
  hhash->block_size_byte = (((STM32_READ_REG(hash_instance->SR) >> HASH_SR_NBWE_Pos) - 1U) << 2U);

  hhash->remain_bytes_number = 0U;
  hhash->phase               = HASH_PHASE_READY;
  hhash->suspend_request     = 0U;
  hhash->global_state        = HAL_HASH_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief Get HASH Configuration parameters.
  * @param hhash    Pointer to a hal_hash_handle_t structure.
  * @param p_config Pointer to a hal_hash_config_t structure.
  */
void HAL_HASH_GetConfig(const hal_hash_handle_t *hhash, hal_hash_config_t *p_config)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_CONFIGURED
                   | (uint32_t)HAL_HASH_STATE_COMPUTE_ACTIVE | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE
                   | (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED | (uint32_t)HAL_HASH_HMAC_STATE_COMPUTE_ACTIVE
                   | (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE | (uint32_t)HAL_HASH_STATE_SUSPENDED);

  const HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  p_config->data_swapping = (hal_hash_data_swapping_t)(uint32_t)((hash_instance->CR) & (HASH_CR_DATATYPE));
  p_config->algorithm = (hal_hash_algo_t)(uint32_t)((hash_instance->CR) & (HASH_CR_ALGO));
}
/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group3
  * @{
This section provides API allowing to calculate the hash value using one of the HASH algorithms supported by
the peripheral.

