MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
For a single buffer to be hashed, user can resort to one of three processing functions available:
- Polling mode   : HAL_HASH_Compute()
- Interrupt mode : HAL_HASH_Compute_IT()
- DMA mode       : HAL_HASH_Compute_DMA()

In case of multi-buffer HASH processing (a single digest is computed while several buffers are fed to the peripheral),
the user can resort to successive calls to :
- Polling mode : Call HAL_HASH_Update() to continue HASH update process.
- Interrupt mode : Call HAL_HASH_Update_IT() to continue HASH update process.
- DMA mode: Call HAL_HASH_Update_DMA() to continue HASH update process.

To retrieve the digest computation, call HAL_HASH_Finish().
  */
/**
  * @brief Compute HASH input buffer in polling mode then retrieve the computed digest in the output buffer
  *        and its size in bytes.
  * @param  hhash                    Pointer to a hal_hash_handle_t structure.
  * @param  p_input_buffer           Pointer to the input buffer (buffer to be hashed).
  * @param  input_size_byte          Size of the input buffer in bytes.
  * @param  p_output_buffer          Pointer to the computed digest.
  * @param  output_buffer_size_byte  Size of the output buffer in bytes provided by the user.
  * @param  p_output_hash_size_byte  Pointer to the size of the digest in bytes.
  * @param  timeout_ms               Specify timeout value in millisecond
  * @retval HAL_INVALID_PARAM        Invalid parameter.
  * @retval HAL_TIMEOUT              A timeout has occurred.
  * @retval HAL_ERROR                An error has occurred.
  * @retval HAL_BUSY                 Process is already ongoing.
  * @retval HAL_OK                   Operation completed.
  */
hal_status_t HAL_HASH_Compute(hal_hash_handle_t *hhash, const void *p_input_buffer, uint32_t input_size_byte,
                              void *p_output_buffer, uint32_t output_buffer_size_byte,
                              uint32_t *p_output_hash_size_byte, uint32_t timeout_ms)
{
  uint32_t digest_copy_length = 0U;
  uint32_t valid_blocks_nbr   = 0U;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_input_buffer != NULL);
  ASSERT_DBG_PARAM(p_output_buffer != NULL);
  ASSERT_DBG_PARAM(IS_OUT_BUFFER_SIZE_VALID((hhash), (output_buffer_size_byte)));
  ASSERT_DBG_PARAM(p_output_hash_size_byte != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_CONFIGURED);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((p_input_buffer == NULL) || (p_output_buffer == NULL)
      || (output_buffer_size_byte < hhash->digest_size_byte) || (p_output_hash_size_byte == NULL)
      || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hhash, global_state, HAL_HASH_STATE_CONFIGURED, HAL_HASH_STATE_COMPUTE_ACTIVE);

  tickstart = HAL_GetTick();

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  hhash->p_input_buff            = (const uint8_t *)p_input_buffer;
  hhash->p_output_buff           = (uint8_t *)p_output_buffer;
  hhash->input_data_count_byte   = 0U;
  hhash->input_size_byte         = input_size_byte;
  hhash->output_size_byte        = output_buffer_size_byte;
  hhash->p_output_hash_size_byte = p_output_hash_size_byte;
  *p_output_hash_size_byte       = hhash->digest_size_byte;

  STM32_MODIFY_REG(hash_instance->CR, HASH_CR_INIT | HASH_CR_MODE, HASH_CR_INIT);

  /* Configure the number of valid bits in last word of the message */
  STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 8U * ((hhash->input_size_byte) % HASH_WORD_SIZE_BYTE));

  hhash->phase = HASH_PHASE_PROCESS;
  valid_blocks_nbr = input_size_byte / (hhash->block_size_byte + HASH_WORD_SIZE_BYTE);

  for (uint32_t index = 0U; index < valid_blocks_nbr; index++)
  {
    HASH_WriteBlock(hhash);
  }

  if ((hhash->input_size_byte - hhash->input_data_count_byte) != 0U)
  {
    if (HASH_WriteLastBlock(hhash) != HAL_OK)
    {
      hhash->phase = HASH_PHASE_READY;
      hhash->global_state = HAL_HASH_STATE_CONFIGURED;
      return HAL_ERROR;
    }
  }

  /* Start the message Digest calculation */
  STM32_SET_BIT(HASH_GET_INSTANCE(hhash)->STR, HASH_STR_DCAL);

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_DCI, 0U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_STATE_CONFIGURED;
    return HAL_ERROR;
  }

  digest_copy_length = (hhash->output_size_byte > hhash->block_size_byte)
                       ? hhash->block_size_byte : hhash->output_size_byte;
  HASH_GetDigestMsg(hhash, (uint8_t *)hhash->p_output_buff, (uint8_t)digest_copy_length);

  if (HASH_WaitUntilTimeout(hhash, timeout_ms, tickstart) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_STATE_CONFIGURED;
    return HAL_TIMEOUT;
  }

  hhash->phase = HASH_PHASE_READY;
  hhash->global_state = HAL_HASH_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief Compute HASH input buffer in interrupt mode then retrieve the computed digest in the output buffer
  *        and its size in bytes.
  * @param  hhash                    Pointer to a hal_hash_handle_t structure.
  * @param  p_input_buffer           Pointer to the input buffer (buffer to be hashed).
  * @param  input_size_byte          Size of the input buffer in bytes.
  * @param  p_output_buffer          Pointer to the computed digest.
  * @param  output_buffer_size_byte  Size of the output buffer in bytes provided by the user.
  * @param  p_output_hash_size_byte  Pointer to the size of the digest in bytes.
  * @retval HAL_INVALID_PARAM        Invalid parameter.
  * @retval HAL_ERROR                An error has occurred.
  * @retval HAL_BUSY                 Process is already ongoing.
  * @retval HAL_OK                   Operation started correctly.
  */
hal_status_t HAL_HASH_Compute_IT(hal_hash_handle_t *hhash, const void *p_input_buffer,
                                 uint32_t input_size_byte, void *p_output_buffer,
                                 uint32_t output_buffer_size_byte, uint32_t *p_output_hash_size_byte)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_input_buffer != NULL);
  ASSERT_DBG_PARAM(p_output_buffer != NULL);
  ASSERT_DBG_PARAM(IS_OUT_BUFFER_SIZE_VALID((hhash), (output_buffer_size_byte)));
  ASSERT_DBG_PARAM(p_output_hash_size_byte != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_CONFIGURED);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((p_input_buffer == NULL) || (p_output_buffer == NULL)
      || (output_buffer_size_byte < hhash->digest_size_byte) || (p_output_hash_size_byte == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hhash, global_state, HAL_HASH_STATE_CONFIGURED, HAL_HASH_STATE_COMPUTE_ACTIVE);

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  hhash->input_data_count_byte   = 0U;
  hhash->p_input_buff            = (const uint8_t *)p_input_buffer;
  hhash->p_output_buff           = (uint8_t *)p_output_buffer;
  hhash->input_size_byte         = input_size_byte;
  hhash->output_size_byte        = output_buffer_size_byte;
  hhash->p_output_hash_size_byte = p_output_hash_size_byte;
  *p_output_hash_size_byte       = hhash->digest_size_byte;

  STM32_MODIFY_REG(hash_instance->CR, HASH_CR_INIT | HASH_CR_MODE, HASH_CR_INIT);

  /* Configure the number of valid bits in last word of the message */
  STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 8U * ((hhash->input_size_byte) % HASH_WORD_SIZE_BYTE));
  hhash->phase = HASH_PHASE_PROCESS;

