MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  /* The number of word expected to be pushed to DIN is set to the expected block size + 1 in words (0x11) */
  if (hhash->input_size_byte >= (hhash->block_size_byte + HASH_WORD_SIZE_BYTE))
  {
    if (HASH_WriteBlock_IT(hhash) != HAL_OK)
    {
      hhash->phase = HASH_PHASE_READY;
      hhash->global_state = HAL_HASH_STATE_CONFIGURED;
      return HAL_ERROR;
    }
  }

  HAL_HASH_EnableIT(hhash, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);

  return HAL_OK;
}

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
/**
  * @brief Compute HASH input buffer in DMA mode then retrieve the computed digest in the output buffer
  *        and its size in bytes.
  * @param  hhash                    Pointer to a hal_hash_handle_t structure.
  * @param  p_input_buffer           Pointer to the input buffer (buffer to be hashed).
  * @param  input_size_byte          Size of the input buffer in bytes.
  * @param  p_output_buffer          Pointer to the computed digest.
  * @param  output_buffer_size_byte  Size of the output buffer in bytes provided by the user.
  * @param  p_output_hash_size_byte  Pointer to the size of the digest in bytes.
  * @retval HAL_INVALID_PARAM        Invalid parameter.
  * @retval HAL_ERROR                An error has occurred.
  * @retval HAL_BUSY                 Process is already ongoing.
  * @retval HAL_OK                   Operation started correctly.
  */
hal_status_t HAL_HASH_Compute_DMA(hal_hash_handle_t *hhash, const void *p_input_buffer, uint32_t input_size_byte,
                                  void *p_output_buffer, uint32_t output_buffer_size_byte,
                                  uint32_t *p_output_hash_size_byte)
{
  uint32_t input_addr = (uint32_t)p_input_buffer;
  uint32_t tmp_input_size;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_input_buffer != NULL);
  ASSERT_DBG_PARAM(p_output_buffer != NULL);
  ASSERT_DBG_PARAM(IS_OUT_BUFFER_SIZE_VALID((hhash), (output_buffer_size_byte)));
  ASSERT_DBG_PARAM(p_output_hash_size_byte != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_CONFIGURED);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hhash == NULL) || (hhash->hdma_in == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((p_input_buffer == NULL) || (p_output_buffer == NULL)
      || (output_buffer_size_byte < hhash-> digest_size_byte) || (p_output_hash_size_byte == NULL))
  {
    return HAL_INVALID_PARAM;
  }

#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hhash, global_state, HAL_HASH_STATE_CONFIGURED, HAL_HASH_STATE_COMPUTE_ACTIVE);

#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
  hhash->last_error_codes = HAL_HASH_ERROR_NONE;
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  STM32_SET_BIT(hash_instance->CR, HASH_CR_DMAE);

  hhash->p_input_buff            = (const uint8_t *)p_input_buffer;
  hhash->p_output_buff           = (uint8_t *)p_output_buffer;
  hhash->input_data_count_byte   = 0U;
  hhash->input_size_byte         = input_size_byte;
  hhash->output_size_byte        = output_buffer_size_byte;
  hhash->p_output_hash_size_byte = p_output_hash_size_byte;
  *p_output_hash_size_byte       = hhash->digest_size_byte;

  hhash->dma_operation_active_flag = 1U;

  hhash->hdma_in->p_xfer_cplt_cb  = HASH_ComputeDMAXferCplt;
  hhash->hdma_in->p_xfer_error_cb = HASH_DMAError;
  hhash->hdma_in->p_xfer_abort_cb = HASH_DMAAbort;

  STM32_MODIFY_REG(hash_instance->CR, HASH_CR_INIT | HASH_CR_MODE, HASH_CR_INIT);
  hhash->phase = HASH_PHASE_PROCESS;

  /* Configure the number of valid bits in last word of the message */
  STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 8U * ((hhash->input_size_byte) % HASH_WORD_SIZE_BYTE));

  tmp_input_size = (((hhash->input_size_byte % HASH_WORD_SIZE_BYTE) != 0U)
                    ? (hhash->input_size_byte + (HASH_WORD_SIZE_BYTE - (hhash->input_size_byte % 4U)))
                    : (hhash->input_size_byte));

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hhash->hdma_in, input_addr,
                                     (uint32_t) &((HASH_TypeDef *)((uint32_t)(hhash)->instance))->DIN, tmp_input_size,
                                     HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_STATE_CONFIGURED;

#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
    hhash->last_error_codes |= HAL_HASH_ERROR_DMA;
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */

    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* USE_HAL_HASH_DMA */

/**
  * @brief HASH update process in polling mode with several input buffers.
  * @param  hhash              Pointer to a hal_hash_handle_t structure.
  * @param  p_add_input_buffer Pointer to the input buffer (buffer to be hashed).
  * @param  input_size_byte    length of the input buffer in bytes.
  * @param  timeout_ms         Specify timeout value in millisecond.
  * @note   Consecutive calls to HAL_HASH_Update() can be used to feed several input buffers back-to-back to the
  *         peripheral that will yield a single HASH signature once all buffers have been entered.
  *         Wrap-up of input buffers feeding and retrieval of digest is done by a call to HAL_HASH_Finish().
  * @retval HAL_INVALID_PARAM  Invalid parameter.
  * @retval HAL_TIMEOUT        A timeout has occurred.
  * @retval HAL_BUSY           Process is already ongoing.
  * @retval HAL_ERROR          An error has occurred.
  * @retval HAL_OK             Input buffer fed correctly.
  */
hal_status_t HAL_HASH_Update(hal_hash_handle_t *hhash, const void *p_add_input_buffer, uint32_t input_size_byte,
                             uint32_t timeout_ms)
{
  uint32_t valid_blocks_nbr    = 0U;
  uint32_t remain_bytes_nbr    = 0U;
  uint32_t remaining_words_nbr = 0U;
  uint32_t tick_start;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_add_input_buffer != NULL);
  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_CONFIGURED | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((p_add_input_buffer == NULL) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HASH_CHECK_UPDATE_STATE(hhash, global_state,
                          ((uint32_t)HAL_HASH_STATE_CONFIGURED | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE),
                          HAL_HASH_STATE_UPDATE_ACTIVE);

  tick_start = HAL_GetTick();

