MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  hhash->p_input_buff          = (const uint8_t *)p_add_input_buffer;
  hhash->input_data_count_byte = 0U;
  hhash->input_size_byte       = input_size_byte;

  if (hhash->phase == HASH_PHASE_READY)
  {
    STM32_MODIFY_REG(HASH_GET_INSTANCE(hhash)->CR, HASH_CR_INIT | HASH_CR_MODE, HASH_CR_INIT);
    hhash->phase = HASH_PHASE_PROCESS;
  }

  if (hhash->remain_bytes_number != 0U)
  {
    HASH_AppendLastIncompleteWord(hhash);
  }

  valid_blocks_nbr = hhash->input_size_byte / (hhash->block_size_byte + HASH_WORD_SIZE_BYTE);
  for (uint32_t index = 0U; index < valid_blocks_nbr; index++)
  {
    HASH_WriteBlock(hhash);
  }

  remain_bytes_nbr = hhash->input_size_byte - hhash->input_data_count_byte;
  if (remain_bytes_nbr != 0U)
  {
    remaining_words_nbr = remain_bytes_nbr / HASH_WORD_SIZE_BYTE;

    if (remaining_words_nbr != 0U)
    {
      if (HASH_WriteIncompleteBlock(hhash, remaining_words_nbr) != HAL_OK)
      {
        hhash->phase = HASH_PHASE_READY;
        hhash->global_state = HAL_HASH_STATE_CONFIGURED;
        return HAL_ERROR;
      }
    }

    /* Still remaining bytes to save for next HASH update or Finish operation */
    if ((remain_bytes_nbr % HASH_WORD_SIZE_BYTE) != 0U)
    {
      HASH_SaveRemainingBytes(hhash, remain_bytes_nbr);
    }
  }

  if (HASH_WaitUntilTimeout(hhash, timeout_ms, tick_start) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_STATE_CONFIGURED;
    return HAL_TIMEOUT;
  }

  return HAL_OK;
}

/**
  * @brief  HASH update process in interrupt mode several input buffers.
  * @param  hhash              Pointer to a hal_hash_handle_t structure.
  * @param  p_add_input_buffer Pointer to the input buffer (buffer to be hashed).
  * @param  input_size_byte    length of the input buffer in bytes.
  * @note   Consecutive calls to HAL_HASH_Update_IT() can be used to feed several input buffers back-to-back
  *         to the peripheral that will yield a single HASH signature once all buffers have been entered.
  *         Wrap-up of input buffers feeding and retrieval of digest is done by a call to HAL_HASH_Finish().
  * @retval HAL_INVALID_PARAM  Invalid parameter.
  * @retval HAL_ERROR          An error has occurred.
  * @retval HAL_BUSY           Process is already ongoing.
  * @retval HAL_OK             The update of the given buffer has been processed correctly.
  */
hal_status_t HAL_HASH_Update_IT(hal_hash_handle_t *hhash, const void *p_add_input_buffer, uint32_t input_size_byte)
{
  uint32_t remain_bytes_nbr = 0U;
  uint32_t remaining_words_nbr = 0U;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_add_input_buffer != NULL);
  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_CONFIGURED | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (p_add_input_buffer == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HASH_CHECK_UPDATE_STATE(hhash, global_state,
                          ((uint32_t)HAL_HASH_STATE_CONFIGURED | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE),
                          HAL_HASH_STATE_UPDATE_ACTIVE);

  if (hhash->phase == HASH_PHASE_READY)
  {
    STM32_MODIFY_REG(HASH_GET_INSTANCE(hhash)->CR, HASH_CR_INIT | HASH_CR_MODE, HASH_CR_INIT);
    hhash->phase = HASH_PHASE_PROCESS;
  }

  hhash->p_input_buff = (const uint8_t *)p_add_input_buffer;
  hhash->input_data_count_byte = 0U;
  hhash->input_size_byte = input_size_byte;

  if (hhash->remain_bytes_number != 0U)
  {
    HASH_AppendLastIncompleteWord(hhash);
  }

  /* The number of word expected to be pushed to DIN is set to the expected block size + 1 in words ( 0x11) */
  if (hhash->input_size_byte >= (hhash->block_size_byte + HASH_WORD_SIZE_BYTE))
  {
    if (HASH_WriteBlock_IT(hhash) != HAL_OK)
    {
      hhash->phase = HASH_PHASE_READY;
      hhash->global_state = HAL_HASH_STATE_CONFIGURED;
      return HAL_ERROR;
    }

    HAL_HASH_EnableIT(hhash, HAL_HASH_IT_DIN);
  }
  else /* No complete block */
  {
    remain_bytes_nbr = hhash->input_size_byte - hhash->input_data_count_byte;
    remaining_words_nbr = remain_bytes_nbr / HASH_WORD_SIZE_BYTE;

    if (remaining_words_nbr != 0U)
    {
      if (HASH_WriteIncompleteBlock(hhash, remaining_words_nbr) != HAL_OK)
      {
        hhash->phase = HASH_PHASE_READY;
        hhash->global_state = HAL_HASH_STATE_CONFIGURED;
        return HAL_ERROR;
      }
    }

    /* Still remaining bytes to save for next HASH update or Finish operation */
    if ((remain_bytes_nbr % HASH_WORD_SIZE_BYTE) != 0U)
    {
      HASH_SaveRemainingBytes(hhash, remain_bytes_nbr);
    }
  }

  return HAL_OK;
}

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
/**
  * @brief  HASH update process in DMA mode with several input buffers.
  * @param  hhash              Pointer to a hal_hash_handle_t structure.
  * @param  p_add_input_buffer Pointer to the input buffer (buffer to be hashed).
  * @param  input_size_byte    length of the input buffer in bytes.
  * @retval HAL_INVALID_PARAM  Invalid parameter.
  * @retval HAL_ERROR          An error has occurred.
  * @retval HAL_BUSY           Process is already ongoing.
  * @retval HAL_OK             The update of the given buffer has been processed correctly.
  */
hal_status_t HAL_HASH_Update_DMA(hal_hash_handle_t *hhash, const void *p_add_input_buffer, uint32_t input_size_byte)
{
  uint32_t tmp_input_addr;
  uint8_t remain_size_byte;
  uint32_t valid_words_nbr;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_add_input_buffer != NULL);
  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_CONFIGURED | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
  || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (p_add_input_buffer == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hhash == NULL) || (hhash->hdma_in == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HASH_CHECK_UPDATE_STATE(hhash, global_state,
                          ((uint32_t)HAL_HASH_STATE_CONFIGURED | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE),
                          HAL_HASH_STATE_UPDATE_ACTIVE);

