MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  HASH_TypeDef *hash_instance      = HASH_GET_INSTANCE(hhash);
  hhash->p_input_buff              = (const uint8_t *)p_add_input_buffer;
  hhash->input_data_count_byte     = 0U;
  hhash->input_size_byte           = input_size_byte;
  hhash->dma_operation_active_flag = 1U;

  hhash->hdma_in->p_xfer_cplt_cb  = HASH_UpdateDMAXferCplt;
  hhash->hdma_in->p_xfer_error_cb = HASH_DMAError;
  hhash->hdma_in->p_xfer_abort_cb = HASH_DMAAbort;

  STM32_SET_BIT(hash_instance->CR, HASH_CR_DMAE);

  if (hhash->phase == HASH_PHASE_READY)
  {
    STM32_MODIFY_REG(hash_instance->CR, HASH_CR_INIT | HASH_CR_MODE, HASH_CR_INIT);
    hhash->phase = HASH_PHASE_PROCESS;
    STM32_SET_BIT(hash_instance->CR, HASH_CR_MDMAT);
  }

  /* Process the remaining bytes of the previous buffer */
  if (hhash->remain_bytes_number != 0U)
  {
    HASH_AppendLastIncompleteWord(hhash);
  }

  tmp_input_addr = (uint32_t)hhash->p_input_buff;
  remain_size_byte = (uint8_t)(hhash->input_size_byte % HASH_WORD_SIZE_BYTE);

  /* Store remaining bytes in remain_bytes */
  if (remain_size_byte > 0U)
  {
    hhash->input_size_byte = hhash->input_size_byte - remain_size_byte;
    for (uint32_t i = 0U; i < remain_size_byte; i++)
    {
      hhash->remain_bytes[i] = ((uint8_t *)tmp_input_addr)[hhash->input_size_byte + i];
    }
    hhash->remain_bytes_number = remain_size_byte;
  }

  valid_words_nbr = hhash->input_size_byte / HASH_WORD_SIZE_BYTE;
  if (valid_words_nbr > 0U)
  {
    STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 0U);
    if (HAL_DMA_StartPeriphXfer_IT_Opt(hhash->hdma_in,
                                       tmp_input_addr,
                                       (uint32_t) &((HASH_TypeDef *)((uint32_t)(hhash)->instance))->DIN,
                                       hhash->input_size_byte,
                                       HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
      hhash->last_error_codes |= HAL_HASH_ERROR_DMA;
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */
      hhash->global_state = HAL_HASH_STATE_CONFIGURED;
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}
#endif /* USE_HAL_HASH_DMA */

/**
  * @brief Finish HASH update process.
  * @param  hhash                    Pointer to a hal_hash_handle_t structure.
  * @param  p_output_buffer          Pointer to the computed digest.
  * @param  output_buffer_size_byte  Size of the output buffer in bytes provided by the user.
  * @param  p_output_hash_size_byte  Pointer to the size of the digest in bytes.
  * @param  timeout_ms               Specify timeout value in millisecond.
  * @retval HAL_INVALID_PARAM        Invalid parameter.
  * @retval HAL_TIMEOUT              A timeout has occurred.
  * @retval HAL_ERROR                An error has occurred.
  * @retval HAL_OK                   Hash operation correctly completed and digest available in the output buffer.
  */
hal_status_t HAL_HASH_Finish(hal_hash_handle_t *hhash, void *p_output_buffer, uint32_t output_buffer_size_byte,
                             uint32_t *p_output_hash_size_byte, uint32_t timeout_ms)
{
  uint32_t digest_copy_length = 0U;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_output_buffer != NULL);
  ASSERT_DBG_PARAM(IS_OUT_BUFFER_SIZE_VALID((hhash), (output_buffer_size_byte)));
  ASSERT_DBG_PARAM(p_output_hash_size_byte != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((p_output_buffer == NULL) || (p_output_hash_size_byte == NULL)
      || (output_buffer_size_byte < hhash->digest_size_byte) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

  tickstart = HAL_GetTick();

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  hhash->output_size_byte        = output_buffer_size_byte;
  hhash->p_output_buff           = (uint8_t *)p_output_buffer;
  hhash->p_output_hash_size_byte = p_output_hash_size_byte;
  *p_output_hash_size_byte       = hhash->digest_size_byte;

  if (hhash->remain_bytes_number != 0U)
  {
    /* Configure the number of valid bits in last word of the message */
    STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, (8U * (uint32_t)hhash->remain_bytes_number));

    HASH_WriteRemainingByte(hhash, (uint8_t *)hhash->remain_bytes, hhash->remain_bytes_number);
  }
  else
  {
    /* Configure the number of valid bits in last word of the message */
    STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 8U * (hhash->input_size_byte % HASH_WORD_SIZE_BYTE));
  }

  /* Start the message padding then the Digest calculation */
  STM32_SET_BIT(HASH_GET_INSTANCE(hhash)->STR, HASH_STR_DCAL);

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_DCI, 0U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_STATE_CONFIGURED;
    return HAL_ERROR;
  }

  digest_copy_length = (hhash->output_size_byte > hhash->block_size_byte)
                       ? hhash->block_size_byte : hhash->output_size_byte;
  HASH_GetDigestMsg(hhash, (uint8_t *)hhash->p_output_buff, (uint8_t)digest_copy_length);

  if (HASH_WaitUntilTimeout(hhash, timeout_ms, tickstart) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_STATE_CONFIGURED;
    return HAL_TIMEOUT;
  }

  if (STM32_IS_BIT_SET(hash_instance->CR, HASH_CR_MDMAT))
  {
    STM32_CLEAR_BIT(((HASH_TypeDef *)((uint32_t)(hhash->instance)))->CR, HASH_CR_MDMAT);
  }

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  hhash->dma_operation_active_flag = 0U;
#endif /* USE_HAL_HASH_DMA */
  hhash->remain_bytes_number = 0U;
  hhash->phase               = HASH_PHASE_READY;
  hhash->global_state        = HAL_HASH_STATE_CONFIGURED;

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group4
  * @{
This subsection provides a set of functions allowing to set and get the HASH HMAC configuration.
- Use the function HAL_HASH_HMAC_SetConfig() to Configure HASH HMAC with the specified parameters in the
  hal_hash_hmac_config_t Parameters which are :
   - Data Swapping : no swap or half word swap or bit swap or byte swap.
   - Key and key size in byte to use for the HMAC operation
- Use the function HAL_HASH_HMAC_GetConfig() to retrieve the HAL HASH HMAC configuration.
  */
/**
  * @brief Configure the HASH HMAC according to the specified parameters in the hal_hash_hmac_config_t.
  * @param hhash              Pointer to a hal_hash_handle_t structure.
  * @param p_config           Pointer to a hal_hash_hmac_config_t structure.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_OK            Operation started correctly.
  */
hal_status_t HAL_HASH_HMAC_SetConfig(hal_hash_handle_t *hhash, const hal_hash_hmac_config_t *p_config)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_HASH_DATA_SWAPPING(p_config->data_swapping));
  ASSERT_DBG_PARAM(IS_HASH_HMAC_ALGORITHM(p_config->algorithm));
  ASSERT_DBG_PARAM(p_config->p_hmac_key != NULL);
  ASSERT_DBG_PARAM(p_config->key_size_byte != 0U);

