MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  ASSERT_DBG_STATE(hhash->global_state, ((uint32_t)HAL_HASH_STATE_INIT) | (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED
                   | (uint32_t)HAL_HASH_STATE_CONFIGURED);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  /* Set the data type and algorithm */
  STM32_MODIFY_REG(hash_instance->CR, HASH_CR_DATATYPE | HASH_CR_ALGO | HASH_CR_INIT,
                   (((uint32_t)p_config->data_swapping | (uint32_t)p_config->algorithm | HASH_CR_INIT)));

  hhash->phase = HASH_PHASE_READY;

  /* Get the digest size in bytes according to the selected algorithm */
  hhash->digest_size_byte = HASH_GetDigestLength(p_config->algorithm);

  /* Get the block size in bytes which can be deduced from the number of expected words returned by NBWE bits */
  hhash->block_size_byte = (((STM32_READ_REG(hash_instance->SR) >> HASH_SR_NBWE_Pos) - 1U) << 2U);

  hhash->remain_bytes_number   = 0U;
  hhash->p_hmac_key_buff       = p_config->p_hmac_key;
  hhash->key_size_byte         = p_config->key_size_byte;
  hhash->p_hmac_key_saved      = p_config->p_hmac_key;
  hhash->input_data_count_byte = 0U;

  HASH_SetHMACMode(hhash, hhash->key_size_byte);

  hhash->phase = HASH_PHASE_PROCESS;

  /* Configure the number of valid bits in last word of the Key */
  STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 8U * ((p_config->key_size_byte) % HASH_WORD_SIZE_BYTE));
  HASH_WriteKey(hhash, p_config->p_hmac_key, p_config->key_size_byte);

  /* Start the Key padding then the Digest calculation */
  STM32_SET_BIT(hash_instance->STR, HASH_STR_DCAL);

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_DCI, 1U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
    return HAL_ERROR;
  }

  hhash->phase           = HASH_PHASE_HMAC_MESSAGE_ENTRY;
  hhash->suspend_request = 0U;
  hhash->global_state    = HAL_HASH_HMAC_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief Get HASH HMAC Configuration parameters.
  * @param hhash       Pointer to a hal_hash_handle_t structure.
  * @param p_config    Pointer to a hal_hash_hmac_config_t structure.
  */
void HAL_HASH_HMAC_GetConfig(const hal_hash_handle_t *hhash, hal_hash_hmac_config_t *p_config)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_CONFIGURED
                   | (uint32_t)HAL_HASH_STATE_COMPUTE_ACTIVE | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE
                   | (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED | (uint32_t)HAL_HASH_HMAC_STATE_COMPUTE_ACTIVE
                   | (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE | (uint32_t)HAL_HASH_STATE_SUSPENDED);

  const HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  p_config->data_swapping = (hal_hash_data_swapping_t)(uint32_t)((hash_instance->CR) & (HASH_CR_DATATYPE));
  p_config->algorithm     = (hal_hash_algo_t)(uint32_t)((hash_instance->CR) & (HASH_CR_ALGO));
  p_config->p_hmac_key    = hhash->p_hmac_key_saved;
  p_config->key_size_byte = hhash->key_size_byte;
}
/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group5
  * @{
This section provides API allowing to calculate the HMAC (keyed-hash message authentication code).

To calculate the HMAC for a single buffer, user can resort to one of three processing functions available:
- Polling mode : HAL_HASH_HMAC_Compute()
- Interrupt mode : HAL_HASH_HMAC_Compute_IT()
- DMA mode : HAL_HASH_HMAC_Compute_DMA()

In case of multi-buffer HMAC processing (a single digest is computed while several buffers are fed to the peripheral),
the user can resort to successive calls to :
- Polling mode : Call HAL_HASH_HMAC_Update() to continue HASH HMAC update process.
- Interrupt mode : Call HAL_HASH_HMAC_Update_IT() to continue HASH HMAC update process.
- DMA mode: Call HAL_HASH_HMAC_Update_DMA() to continue HASH HMAC update process.

To retrieve the digest computation, call HAL_HASH_HMAC_Finish().
  */
/**
  * @brief Compute HASH HMAC input buffer in polling mode, then retrieve the computed digest in the output buffer
  *        and its size in bytes.
  * @param hhash                   Pointer to a hal_hash_handle_t structure.
  * @param p_input_buffer          Pointer to the input buffer (buffer to be hashed).
  * @param input_size_byte         length of the input buffer in bytes.
  * @param p_output_buffer         Pointer to the computed digest.
  * @param output_buffer_size_byte Size of the output buffer in bytes provided by the user.
  * @param p_output_hash_size_byte Pointer to the size of the digest in bytes.
  * @param timeout_ms              Specify timeout value in millisecond.
  * @retval                        HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT            A timeout has occurred.
  * @retval HAL_ERROR              An error has occurred.
  * @retval HAL_BUSY               Process is already ongoing.
  * @retval HAL_OK                 Operation completed.
  */
hal_status_t HAL_HASH_HMAC_Compute(hal_hash_handle_t *hhash, const void *p_input_buffer, uint32_t input_size_byte,
                                   void *p_output_buffer, uint32_t output_buffer_size_byte,
                                   uint32_t *p_output_hash_size_byte, uint32_t timeout_ms)
{
  uint32_t digest_copy_length = 0U;
  uint32_t valid_blocks_nbr   = 0U;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_input_buffer != NULL);
  ASSERT_DBG_PARAM(p_output_buffer != NULL);
  ASSERT_DBG_PARAM(IS_OUT_BUFFER_SIZE_VALID((hhash), (output_buffer_size_byte)));
  ASSERT_DBG_PARAM(p_output_hash_size_byte != NULL);

