MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((p_input_buffer == NULL) || (p_output_buffer == NULL)
      || (output_buffer_size_byte < hhash->digest_size_byte) || (p_output_hash_size_byte == NULL)
      || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  HAL_CHECK_UPDATE_STATE(hhash, global_state, HAL_HASH_HMAC_STATE_CONFIGURED, HAL_HASH_HMAC_STATE_COMPUTE_ACTIVE);

  tickstart = HAL_GetTick();

  hhash->phase                   = HASH_PHASE_READY;
  hhash->p_input_buff            = (const uint8_t *)p_input_buffer;
  hhash->p_output_buff           = (uint8_t *)p_output_buffer;
  hhash->input_data_count_byte   = 0U;
  hhash->input_size_byte         = input_size_byte;
  hhash->output_size_byte        = output_buffer_size_byte;
  hhash->p_output_hash_size_byte = p_output_hash_size_byte;
  *p_output_hash_size_byte       = hhash->digest_size_byte;

  /* Configure the number of valid bits in last word of the message */
  STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 8U * ((hhash->input_size_byte) % HASH_WORD_SIZE_BYTE));
  hhash->input_data_count_byte = 0U;

  valid_blocks_nbr = input_size_byte / (hhash->block_size_byte + HASH_WORD_SIZE_BYTE);
  for (uint32_t index = 0U; index < valid_blocks_nbr; index++)
  {
    HASH_WriteBlock(hhash);
  }

  if ((hhash->input_size_byte - hhash->input_data_count_byte) != 0U)
  {
    if (HASH_WriteLastBlock(hhash) != HAL_OK)
    {
      hhash->phase        = HASH_PHASE_READY;
      hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
      return HAL_ERROR;
    }
  }

  /* Start the message padding then the Digest calculation */
  STM32_SET_BIT(hash_instance->STR, HASH_STR_DCAL);

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_BUSY, 1U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    hhash->phase        = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
    return HAL_ERROR;
  }

  /* Configure the number of valid bits in last word of the Key */
  STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 8U * ((hhash->key_size_byte) % HASH_WORD_SIZE_BYTE));
  hhash->input_data_count_byte = 0U;
  HASH_WriteKey(hhash, hhash->p_hmac_key_saved, hhash->key_size_byte);

  /* Start the message padding then the Digest calculation */
  STM32_SET_BIT(HASH_GET_INSTANCE(hhash)->STR, HASH_STR_DCAL);

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_DCI, 0U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
    return HAL_ERROR;
  }

  digest_copy_length = (output_buffer_size_byte < hhash->digest_size_byte) ? output_buffer_size_byte :
                       hhash->digest_size_byte;
  HASH_GetDigestMsg(hhash, (uint8_t *)p_output_buffer, (uint8_t)digest_copy_length);

  if (HASH_WaitUntilTimeout(hhash, timeout_ms, tickstart) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
    return HAL_TIMEOUT;
  }

  hhash->phase        = HASH_PHASE_READY;
  hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief Compute HASH HMAC input buffer in interrupt mode, retrieve the computed digest in the output buffer
  *        and its size in bytes.
  * @param hhash                   Pointer to a hal_hash_handle_t structure.
  * @param p_input_buffer          Pointer to the input buffer (buffer to be hashed).
  * @param input_size_byte         length of the input buffer in bytes.
  * @param p_output_buffer         Pointer to the computed digest.
  * @param output_buffer_size_byte Size of the output buffer in bytes provided by the user.
  * @param p_output_hash_size_byte Pointer to the length of the computed digest in bytes.
  * @retval HAL_INVALID_PARAM      Invalid parameter.
  * @retval HAL_ERROR              An error has occurred.
  * @retval HAL_BUSY               Process is already ongoing.
  * @retval HAL_OK                 Operation started correctly.
  */
hal_status_t HAL_HASH_HMAC_Compute_IT(hal_hash_handle_t *hhash, const void *p_input_buffer, uint32_t input_size_byte,
                                      void *p_output_buffer, uint32_t output_buffer_size_byte,
                                      uint32_t *p_output_hash_size_byte)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_input_buffer != NULL);
  ASSERT_DBG_PARAM(p_output_buffer != NULL);
  ASSERT_DBG_PARAM(IS_OUT_BUFFER_SIZE_VALID((hhash), (output_buffer_size_byte)));
  ASSERT_DBG_PARAM(p_output_hash_size_byte != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((p_input_buffer == NULL) || (p_output_buffer == NULL)
      || (output_buffer_size_byte < hhash->digest_size_byte) || (p_output_hash_size_byte == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hhash, global_state, HAL_HASH_HMAC_STATE_CONFIGURED, HAL_HASH_HMAC_STATE_COMPUTE_ACTIVE);

  hhash->phase = HASH_PHASE_READY;

  hhash->p_input_buff            = (const uint8_t *)p_input_buffer;
  hhash->p_output_buff           = (uint8_t *)p_output_buffer;
  hhash->p_hmac_key_buff         = hhash->p_hmac_key_saved;
  hhash->input_data_count_byte   = 0U;
  hhash->input_size_byte         = input_size_byte;
  hhash->output_size_byte        = output_buffer_size_byte;
  hhash->p_output_hash_size_byte = p_output_hash_size_byte;
  *p_output_hash_size_byte       = hhash->digest_size_byte;

  hhash->phase = HASH_PHASE_HMAC_MESSAGE_ENTRY;

  /* Configure the number of valid bits in last word of the message */
  STM32_MODIFY_REG(HASH_GET_INSTANCE(hhash)->STR, HASH_STR_NBLW, 8U * ((hhash->input_size_byte) % HASH_WORD_SIZE_BYTE));

  /* The number of word expected to be pushed to DIN is set to the expected block size +1 in words ( 0x11) */
  if (hhash->input_size_byte >= (hhash->block_size_byte + HASH_WORD_SIZE_BYTE))
  {
    if (HASH_WriteBlock_IT(hhash) != HAL_OK)
    {
      hhash->phase = HASH_PHASE_READY;
      hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
      return HAL_ERROR;
    }
  }

  HAL_HASH_EnableIT(hhash, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);

  return HAL_OK;
}

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
/**
  * @brief Compute HASH HMAC input buffer in DMA mode, then retrieve the computed digest in the output buffer
  *        and its size in bytes.
  * @param hhash                   Pointer to a hal_hash_handle_t structure.
  * @param p_input_buffer          Pointer to the input buffer (buffer to be hashed).
  * @param input_size_byte         length of the input buffer in bytes.
  * @param p_output_buffer         Pointer to the computed digest.
  * @param output_buffer_size_byte Size of the output buffer in bytes provided by the user.
  * @param p_output_hash_size_byte Pointer to the length of the computed digest in bytes.
  * @retval HAL_INVALID_PARAM      Invalid parameter.
  * @retval HAL_ERROR              An error has occurred.
  * @retval HAL_BUSY               Process is already ongoing.
  * @retval HAL_OK                 Operation started correctly.
  */
hal_status_t HAL_HASH_HMAC_Compute_DMA(hal_hash_handle_t *hhash, const void *p_input_buffer,
                                       uint32_t input_size_byte, void *p_output_buffer,
                                       uint32_t output_buffer_size_byte, uint32_t *p_output_hash_size_byte)
{
  uint32_t src_addr;
  uint32_t size_byte;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_input_buffer != NULL);
  ASSERT_DBG_PARAM(p_output_buffer != NULL);
  ASSERT_DBG_PARAM(IS_OUT_BUFFER_SIZE_VALID((hhash), (output_buffer_size_byte)));
  ASSERT_DBG_PARAM(p_output_hash_size_byte != NULL);

