MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED
                   | (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (p_add_input_buffer == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HASH_CHECK_UPDATE_STATE(hhash, global_state,
                          ((uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED | (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE),
                          HAL_HASH_HMAC_STATE_UPDATE_ACTIVE);

  hhash->p_input_buff          = (const uint8_t *)p_add_input_buffer;
  hhash->input_data_count_byte = 0U;
  hhash->input_size_byte       = input_size_byte;
  hhash->phase                 = HASH_PHASE_HMAC_MESSAGE_ENTRY;

  /* Configure the number of valid bits in last word of the message */
  STM32_MODIFY_REG(HASH_GET_INSTANCE(hhash)->STR, HASH_STR_NBLW, 8U * ((hhash->input_size_byte) % HASH_WORD_SIZE_BYTE));

  if (hhash->remain_bytes_number != 0U)
  {
    HASH_AppendLastIncompleteWord(hhash);
  }

  /* The number of word expected to be pushed to DIN is set to the expected block size +1 in words ( 0x11) */
  if (hhash->input_size_byte >= (hhash->block_size_byte + HASH_WORD_SIZE_BYTE))
  {
    if (HASH_WriteBlock_IT(hhash) != HAL_OK)
    {
      hhash->phase = HASH_PHASE_READY;
      hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
      return HAL_ERROR;
    }

    HAL_HASH_EnableIT(hhash, HAL_HASH_IT_DIN);
  }
  else
  {
    remain_bytes_nbr = hhash->input_size_byte - hhash->input_data_count_byte;
    remaining_words_nbr = remain_bytes_nbr / HASH_WORD_SIZE_BYTE;

    if (remaining_words_nbr != 0U)
    {
      if (HASH_WriteIncompleteBlock(hhash, remaining_words_nbr) != HAL_OK)
      {
        hhash->phase = HASH_PHASE_READY;
        hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
        return HAL_ERROR;
      }
    }

    if ((remain_bytes_nbr % HASH_WORD_SIZE_BYTE) != 0U)
    {
      HASH_SaveRemainingBytes(hhash, remain_bytes_nbr);
    }
  }

  return HAL_OK;
}

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
/**
  * @brief HASH HMAC update process in DMA mode with several input buffers.
  * @param hhash              Pointer to a hal_hash_handle_t structure.
  * @param p_add_input_buffer Pointer to the input buffer (buffer to be hashed).
  * @param input_size_byte    length of the input buffer in bytes.
  * @note  Multi-buffer HMAC processing is possible, consecutive calls to HAL_HASH_HMAC_Update_DMA() can be used to
  *        feed several input buffers back-to-back to the peripheral that will yield a single HASH signature once all
  *        buffers have been entered. Wrap-up of input buffers feeding and retrieval of digest is done by a call to
  *        HAL_HASH_HMAC_Finish().
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_BUSY          Process is already ongoing.
  * @retval HAL_OK            The update of the given buffer has been processed correctly.
  */
hal_status_t HAL_HASH_HMAC_Update_DMA(hal_hash_handle_t *hhash, const void *p_add_input_buffer,
                                      uint32_t input_size_byte)
{
  uint32_t tmp_input_addr;
  uint8_t remain_size_byte;
  uint32_t valid_words_nbr;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_add_input_buffer != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED
                   | (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (p_add_input_buffer == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hhash == NULL) || (hhash->hdma_in == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HASH_CHECK_UPDATE_STATE(hhash, global_state,
                          ((uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED | (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE),
                          HAL_HASH_HMAC_STATE_UPDATE_ACTIVE);

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  hhash->p_input_buff              = (const uint8_t *)p_add_input_buffer;
  hhash->input_data_count_byte     = 0U;
  hhash->input_size_byte           = input_size_byte;
  hhash->dma_operation_active_flag = 1U;

  hhash->hdma_in->p_xfer_cplt_cb  = HASH_HMAC_UpdateDMAXferCplt;
  hhash->hdma_in->p_xfer_error_cb = HASH_DMAError;
  hhash->hdma_in->p_xfer_abort_cb = HASH_DMAAbort;

  STM32_SET_BIT(hash_instance->CR, HASH_CR_MDMAT);

  /* Process the remaining bytes of the previous buffer */
  if (hhash->remain_bytes_number > 0U)
  {
    HASH_AppendLastIncompleteWord(hhash);
  }

  tmp_input_addr = (uint32_t)hhash->p_input_buff;
  remain_size_byte = (uint8_t)(hhash->input_size_byte % HASH_WORD_SIZE_BYTE);

  /* Store remaining bytes */
  if (remain_size_byte > 0U)
  {
    hhash->input_size_byte = hhash->input_size_byte - remain_size_byte;
    for (uint32_t i = 0U; i < remain_size_byte; i++)
    {
      hhash->remain_bytes[i] = ((uint8_t *)tmp_input_addr)[hhash->input_size_byte + i];
    }
    hhash->remain_bytes_number = remain_size_byte;
  }

  valid_words_nbr = hhash->input_size_byte / HASH_WORD_SIZE_BYTE;
  if (valid_words_nbr > 0U)
  {
    /* Configure the number of valid bits in last word of the message */
    STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 0U);

    STM32_SET_BIT(hash_instance ->CR, HASH_CR_DMAE);

    if (HAL_DMA_StartPeriphXfer_IT_Opt(hhash->hdma_in,
                                       tmp_input_addr,
                                       (uint32_t) &((HASH_TypeDef *)((uint32_t)(hhash)->instance))->DIN,
                                       hhash->input_size_byte,
                                       HAL_DMA_OPT_IT_NONE) != HAL_OK)
    {
#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
      hhash->last_error_codes |= HAL_HASH_ERROR_DMA;
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */
      hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}
#endif /* USE_HAL_HASH_DMA */

/**
  * @brief Finish HASH update process.
  * @param  hhash                    Pointer to a hal_hash_handle_t structure.
  * @param  p_output_buffer          Pointer to the computed digest.
  * @param  output_buffer_size_byte  Size of the output buffer in bytes provided by the user.
  * @param  p_output_hash_size_byte  Pointer to the size of the digest in bytes.
  * @param  timeout_ms               Specify timeout value in millisecond.
  * @retval HAL_INVALID_PARAM        Invalid parameter.
  * @retval HAL_TIMEOUT              A timeout has occurred.
  * @retval HAL_ERROR                An error has occurred.
  * @retval HAL_OK                   Hash operation correctly completed and digest available in the output buffer.
  */
hal_status_t HAL_HASH_HMAC_Finish(hal_hash_handle_t *hhash, void *p_output_buffer, uint32_t output_buffer_size_byte,
                                  uint32_t *p_output_hash_size_byte, uint32_t timeout_ms)
{
  uint32_t digest_copy_length = 0U;
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_output_buffer != NULL);
  ASSERT_DBG_PARAM(IS_OUT_BUFFER_SIZE_VALID((hhash), (output_buffer_size_byte)));
  ASSERT_DBG_PARAM(p_output_hash_size_byte != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1) \
    || defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((p_output_buffer == NULL) || (p_output_hash_size_byte == NULL)
      || (output_buffer_size_byte < hhash->digest_size_byte) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM || USE_HAL_SECURE_CHECK_PARAM */

  tickstart = HAL_GetTick();

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  hhash->output_size_byte        = output_buffer_size_byte;
  hhash->p_output_buff           = (uint8_t *)p_output_buffer;
  hhash->p_output_hash_size_byte = p_output_hash_size_byte;
  *p_output_hash_size_byte       = hhash->digest_size_byte;

  if (hhash->remain_bytes_number != 0U)
  {
    /* Configure the number of valid bits in last word of the message */
    STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, (8U * (uint32_t)hhash->remain_bytes_number));
    HASH_WriteRemainingByte(hhash, (uint8_t *)hhash->remain_bytes, hhash->remain_bytes_number);
  }
  else
  {
    /* Configure the number of valid bits in last word of the message */
    STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 0U);
  }

