MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  /* Start the message padding then the Digest calculation */
  STM32_SET_BIT(hash_instance->STR, HASH_STR_DCAL);

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_BUSY, 1U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    hhash->phase        = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
    return HAL_ERROR;
  }

  hhash->input_data_count_byte = 0U;
  /* Configure the number of valid bits in last word of the Key */
  STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 8U * ((hhash->key_size_byte) % HASH_WORD_SIZE_BYTE));
  HASH_WriteKey(hhash, hhash->p_hmac_key_buff, hhash->key_size_byte);

  /* Start the message padding then the Digest calculation */
  STM32_SET_BIT(HASH_GET_INSTANCE(hhash)->STR, HASH_STR_DCAL);

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_DCI, 0U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
    return HAL_ERROR;
  }

  if (STM32_IS_BIT_SET(hash_instance->CR, HASH_CR_MDMAT))
  {
    STM32_CLEAR_BIT(((HASH_TypeDef *)((uint32_t)(hhash->instance)))->CR, HASH_CR_MDMAT);
  }

  digest_copy_length = (output_buffer_size_byte < hhash->digest_size_byte) ? output_buffer_size_byte :
                       hhash->digest_size_byte;
  HASH_GetDigestMsg(hhash, (uint8_t *)p_output_buffer, (uint8_t)digest_copy_length);

  if (HASH_WaitUntilTimeout(hhash, timeout_ms, tickstart) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
    return HAL_TIMEOUT;
  }

  hhash->remain_bytes_number = 0U;
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  hhash->dma_operation_active_flag = 0U;
#endif /* USE_HAL_HASH_DMA */
  hhash->phase        = HASH_PHASE_READY;
  hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group6
  * @{
This section provides functions allowing to:
- Abort in polling mode with HAL_HASH_Abort().
- Abort in IT and DMA mode with HAL_HASH_Abort_IT().
  */
/**
  * @brief Abort HASH/HMAC in polling mode.
  * @param  hhash       Pointer to a hal_hash_handle_t structure.
  * @param  timeout_ms  Specify timeout value in millisecond.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_TIMEOUT       A timeout has occurred.
  * @retval HAL_ERROR         In case of user timeout.
  * @retval HAL_OK            Operation completed.
  */
hal_status_t HAL_HASH_Abort(hal_hash_handle_t *hhash, uint32_t timeout_ms)
{
  uint32_t tick_start;
  hal_hash_state_t tmp_state;
  uint8_t is_hash_compute_active;
  uint8_t is_hash_update_active;
  uint8_t was_hash_compute_active;
  uint8_t was_hash_update_active;

  ASSERT_DBG_PARAM(hhash != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_COMPUTE_ACTIVE | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE
                   | (uint32_t)HAL_HASH_HMAC_STATE_COMPUTE_ACTIVE | (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE
                   | (uint32_t)HAL_HASH_STATE_SUSPENDED);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hhash == NULL) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  tick_start = HAL_GetTick();

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  tmp_state = hhash->global_state;
  is_hash_compute_active = (uint8_t)(tmp_state == HAL_HASH_STATE_COMPUTE_ACTIVE);
  is_hash_update_active  = (uint8_t)(tmp_state == HAL_HASH_STATE_UPDATE_ACTIVE);
  hhash->global_state = HAL_HASH_STATE_ABORT;
  HAL_HASH_DisableIT(hhash, HAL_HASH_IT_DC | HAL_HASH_IT_DIN);
  if (tmp_state == HAL_HASH_STATE_SUSPENDED)
  {
    was_hash_compute_active = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_COMPUTE_ACTIVE);
    was_hash_update_active  = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_UPDATE_ACTIVE);

    HAL_HASH_ClearFlag(hhash, (uint32_t)HAL_HASH_FLAG_DCI | HAL_HASH_FLAG_DINI);
    /* Reset the hash processor core */
    STM32_SET_BIT(hash_instance->CR, HASH_CR_INIT);

    hhash->input_data_count_byte = 0U;
    hhash->input_size_byte       = 0U;
    hhash->suspend_request       = 0U;
    hhash->phase                 = HASH_PHASE_READY;
    hhash->global_state = ((was_hash_compute_active == 1U) || (was_hash_update_active == 1U)) ?
                          HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;

    return HAL_OK;
  }

#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  if ((hash_instance->CR & HASH_CR_DMAE) != 0U)
  {
    STM32_CLEAR_BIT(hash_instance->CR, HASH_CR_DMAE);

    if (HAL_DMA_Abort(hhash->hdma_in) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
#endif /* USE_HAL_HASH_DMA */

  if (HASH_WaitUntilTimeout(hhash, timeout_ms, tick_start) != HAL_OK)
  {
    hhash->phase = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_STATE_CONFIGURED;
    return HAL_TIMEOUT;
  }

  /* Reset the hash processor core */
  STM32_SET_BIT(hash_instance->CR, HASH_CR_INIT);
  HAL_HASH_ClearFlag(hhash, (uint32_t)HAL_HASH_FLAG_DCI | HAL_HASH_FLAG_DINI);

  hhash->global_state = ((is_hash_compute_active == 1U) || (is_hash_update_active == 1U)) ?
                        HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;

  return HAL_OK;
}

/**
  * @brief Abort HASH/HMAC in interrupt mode.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Operation completed.
  */
hal_status_t HAL_HASH_Abort_IT(hal_hash_handle_t *hhash)
{
  hal_hash_state_t tmp_state;
#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  uint8_t is_hash_compute_active;
  uint8_t is_hash_update_active;
#endif /* USE_HAL_HASH_DMA */
  uint8_t was_hash_compute_active;
  uint8_t was_hash_update_active;

  ASSERT_DBG_PARAM(hhash != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_COMPUTE_ACTIVE | (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE
                   | (uint32_t)HAL_HASH_HMAC_STATE_COMPUTE_ACTIVE | (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE
                   | (uint32_t)HAL_HASH_STATE_SUSPENDED);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  was_hash_compute_active = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_COMPUTE_ACTIVE);
  was_hash_update_active  = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_UPDATE_ACTIVE);
  tmp_state = hhash->global_state;
#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  is_hash_compute_active = (uint8_t)(tmp_state == HAL_HASH_STATE_COMPUTE_ACTIVE);
  is_hash_update_active  = (uint8_t)(tmp_state == HAL_HASH_STATE_UPDATE_ACTIVE);
#endif /* USE_HAL_HASH_DMA */
  hhash->previous_state = tmp_state;
  hhash->global_state = HAL_HASH_STATE_ABORT;

  if (tmp_state == HAL_HASH_STATE_SUSPENDED)
  {
    HAL_HASH_DisableIT(hhash, HAL_HASH_IT_DC | HAL_HASH_IT_DIN);
    HAL_HASH_ClearFlag(hhash, (uint32_t)HAL_HASH_FLAG_DCI | HAL_HASH_FLAG_DINI);
    /* Reset the hash processor core */
    STM32_SET_BIT(hash_instance->CR, HASH_CR_INIT);
    hhash->input_data_count_byte = 0U;
    hhash->input_size_byte       = 0U;
    hhash->suspend_request       = 0U;
    hhash->phase                 = HASH_PHASE_READY;
    hhash->global_state = ((was_hash_compute_active == 1U) || (was_hash_update_active == 1U))
                          ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
    return HAL_OK;
  }

#if defined(USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  if (((hash_instance->CR & HASH_CR_DMAE) != 0U) || (hhash->dma_operation_active_flag == 1U))
  {
    /* Disable the DMA transfer on the HASH side */
    STM32_CLEAR_BIT(hash_instance->CR, HASH_CR_DMAE);
    /* Disable the DMA transmit on the DMA side */
    (void)HAL_DMA_Abort_IT(hhash->hdma_in);
    hhash->global_state = ((is_hash_compute_active == 1U) || (is_hash_update_active == 1U))
                          ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
  }
#endif /* USE_HAL_HASH_DMA */

  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group7
  * @{
This section provides HASH IRQ handler and callback functions.
- HAL_HASH_IRQHandler()         : HASH interrupt request.
- HAL_HASH_InputCpltCallback()  : Input data transfer complete callback.
- HAL_HASH_DigestCpltCallback() : Digest computation complete callback.
- HAL_HASH_ErrorCallback()      : HASH error callback.
- HAL_HASH_SuspendCallback()    : HASH suspend callback.
- HAL_HASH_AbortCallback()      : HASH abort callback.

The compilation define USE_HAL_HASH_REGISTER_CALLBACKS when set to 1 allows the user to register custom callbacks.
- Use the function HAL_HASH_RegisterInputCpltCallback() to register a user input complete callback.
- Use the function HAL_HASH_RegisterDigestComputationCpltCallback() to register a user digest computation
complete callback.
- Use the function HAL_HASH_RegisterErrorCpltCallback() to register a user error callback.
- Use the function HAL_HASH_RegisterSuspendCpltCallback() to register a user suspend callback.
- Use the function HAL_HASH_RegisterAbortCpltCallback() to register a user abort callback.
- Use the function HAL_HASH_SetInDMA() to link the input FIFO HAL DMA handle into the HAL HASH handle.
  */
/**
  * @brief HASH interrupt request.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  * @note  HAL_HASH_IRQHandler() handles interrupts in HMAC processing as well.
  */
void HAL_HASH_IRQHandler(hal_hash_handle_t *hhash)
{
  uint32_t digest_copy_length = 0U;
  uint32_t itsource;
  uint32_t itflag;
  uint8_t is_hash_compute_active;
  uint8_t is_hash_update_active;

  ASSERT_DBG_PARAM(hhash != NULL);

  const HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  hal_hash_state_t state = hhash->global_state;

  itsource = hash_instance->IMR;
  itflag   = hash_instance->SR;

  if (((itflag & HAL_HASH_FLAG_DCI) == HAL_HASH_FLAG_DCI) && ((itsource & HAL_HASH_IT_DC) == HAL_HASH_IT_DC))
  {
    digest_copy_length = (hhash->output_size_byte > hhash->block_size_byte)
                         ? hhash->block_size_byte : hhash->output_size_byte;
    HASH_GetDigestMsg(hhash, hhash->p_output_buff, (uint8_t)digest_copy_length);
    HAL_HASH_DisableIT(hhash, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);
    hhash->phase        = HASH_PHASE_READY;
    hhash->global_state = (state == HAL_HASH_STATE_COMPUTE_ACTIVE)
                          ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
    hhash->p_digest_cplt_callback(hhash);
#else
    HAL_HASH_DigestCpltCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
    return;
  }

  if (hhash->suspend_request == 1U)
  {
    hhash->suspend_request = 0U;
    HAL_HASH_DisableIT(hhash, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);
    hhash->previous_state = state;
    hhash->global_state = HAL_HASH_STATE_SUSPENDED;
#if defined(USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
    hhash->p_suspend_cplt_callback(hhash);
#else
    HAL_HASH_SuspendCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
    return;
  }

  /* If peripheral ready to accept new data */
  if ((itflag & HAL_HASH_FLAG_DINI) == HAL_HASH_FLAG_DINI)
  {
    if ((itsource & HAL_HASH_IT_DIN) == HAL_HASH_IT_DIN)
    {
      if (state == HAL_HASH_STATE_ABORT)
      {
        is_hash_compute_active = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_COMPUTE_ACTIVE);
        is_hash_update_active  = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_UPDATE_ACTIVE);
        HAL_HASH_DisableIT(hhash, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);
        hhash->global_state = ((is_hash_compute_active == 1U) || (is_hash_update_active == 1U))
                              ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
        hhash->p_abort_cplt_callback(hhash);
#else
        HAL_HASH_AbortCallback(hhash);
#endif /* (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1) */
        return;
      }

