MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
      if ((state == HAL_HASH_STATE_COMPUTE_ACTIVE) || (state == HAL_HASH_HMAC_STATE_COMPUTE_ACTIVE))
      {
        if ((hhash->phase == HASH_PHASE_HMAC_MESSAGE_ENTRY) || (hhash->phase == HASH_PHASE_HMAC_OUTER_KEY_ENTRY)
            || (hhash->phase == HASH_PHASE_PROCESS))
        {
          if (HASH_HMAC_ComputeProcessData_IT(hhash) != HAL_OK)
          {
            HAL_HASH_DisableIT(hhash, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);
            hhash->phase = HASH_PHASE_READY;
            hhash->global_state = (state == HAL_HASH_STATE_COMPUTE_ACTIVE)
                                  ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
            hhash->p_error_callback(hhash);
#else
            HAL_HASH_ErrorCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
            return;
          }
        }

        if (((hhash->input_size_byte == hhash->input_data_count_byte) && (hhash->phase == HASH_PHASE_PROCESS))
            || ((hhash->phase == HASH_PHASE_HMAC_OUTER_KEY_ENTRY)
                && (hhash->key_size_byte == hhash->input_data_count_byte)))
        {
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
          hhash->p_input_cplt_callback(hhash);
#else
          HAL_HASH_InputCpltCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
          /* Start the Digest calculation */
          STM32_SET_BIT(HASH_GET_INSTANCE(hhash)->STR, HASH_STR_DCAL);
        }
      }

      if ((state == HAL_HASH_HMAC_STATE_UPDATE_ACTIVE) || (state == HAL_HASH_STATE_UPDATE_ACTIVE))
      {
        if (HASH_HMAC_UpdateProcessData_IT(hhash) != HAL_OK)
        {
          HAL_HASH_DisableIT(hhash, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);
          hhash->phase = HASH_PHASE_READY;
          hhash->global_state = (state == HAL_HASH_STATE_UPDATE_ACTIVE)
                                ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
          hhash->p_error_callback(hhash);
#else
          HAL_HASH_ErrorCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
          return;
        }
#if defined(USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
        hhash->p_input_cplt_callback(hhash);
#else
        HAL_HASH_InputCpltCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
      }
    }
  }
}

/**
  * @brief Input data transfer complete callback.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  * @warning HAL_HASH_InputCpltCallback() is called when the complete input message has been fed to the peripheral.
  *          This API is invoked only when input data are entered in interrupt mode or through DMA mode.
  * @warning In case of HASH or HMAC update DMA feeding case, HAL_HASH_InputCpltCallback() is
  *          called at the end of each buffer feeding to the peripheral.
  */
__WEAK void HAL_HASH_InputCpltCallback(hal_hash_handle_t *hhash)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhash);

  /* WARNING: This function must not be modified, when the callback is needed,
    *          HAL_HASH_InputCpltCallback() can be implemented in the user file.
    */
}

/**
  * @brief Digest computation complete callback.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  * @note  HAL_HASH_DigestCpltCallback() is used in interrupt mode and is not relevant in DMA mode.
  */
__WEAK void HAL_HASH_DigestCpltCallback(hal_hash_handle_t *hhash)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhash);

  /* WARNING: This function must not be modified, when the callback is needed,
    *          HAL_HASH_DigestCpltCallback() can be implemented in the user file.
    */
}

/**
  * @brief HASH error callback.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  */
__WEAK void HAL_HASH_ErrorCallback(hal_hash_handle_t *hhash)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhash);

  /* WARNING: This function must not be modified, when the callback is needed,
    *          HAL_HASH_ErrorCallback() can be implemented in the user file.
    */
}

/**
  * @brief HASH suspend callback.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  */
__WEAK void HAL_HASH_SuspendCallback(hal_hash_handle_t *hhash)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhash);

  /* WARNING: This function must not be modified, when the callback is needed,
    *          HAL_HASH_SuspendCallback() can be implemented in the user file.
    */
}

/**
  * @brief HASH abort callback.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  */
__WEAK void HAL_HASH_AbortCallback(hal_hash_handle_t *hhash)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hhash);

  /* WARNING: This function must not be modified, when the callback is needed,
    *          HAL_HASH_AbortCallback() can be implemented in the user file.
    */
}

#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
/**
  * @brief Register the user hash input callback to be used instead of the weak (overridden) predefined callback.
  * @param hhash    Pointer to a hal_hash_handle_t structure.
  * @param callback Pointer to the callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register callback completed successfully.
  */
hal_status_t HAL_HASH_RegisterInputCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhash->p_input_cplt_callback = callback;

  return HAL_OK;
}

/**
  * @brief Register the user hash digest Callback to be used instead of the weak (overridden) predefined callback.
  * @param hhash    Pointer to a hal_hash_handle_t structure.
  * @param callback Pointer to the callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register callback completed successfully.
  */
hal_status_t HAL_HASH_RegisterDigestComputationCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhash->p_digest_cplt_callback = callback;

  return HAL_OK;
}

/**
  * @brief Register the user hash error Callback to be used instead of the weak (overridden) predefined callback.
  * @param hhash    Pointer to a hal_hash_handle_t structure.
  * @param callback Pointer to the callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register callback completed successfully.
  */
hal_status_t HAL_HASH_RegisterErrorCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

