MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  hhash->p_error_callback = callback;

  return HAL_OK;
}

/**
  * @brief Register the user hash suspend Callback to be used instead of the weak (overridden) predefined callback.
  * @param hhash    Pointer to a hal_hash_handle_t structure.
  * @param callback Pointer to the Callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register callback completed successfully.
  */
hal_status_t HAL_HASH_RegisterSuspendCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhash->p_suspend_cplt_callback = callback;

  return HAL_OK;
}

/**
  * @brief Register the user hash abort Callback to be used instead of the weak (overridden) predefined callback.
  * @param hhash    Pointer to a hal_hash_handle_t structure.
  * @param callback Pointer to the Callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register callback completed successfully.
  */
hal_status_t HAL_HASH_RegisterAbortCpltCallback(hal_hash_handle_t *hhash, hal_hash_cb_t callback)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(callback != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hhash->p_abort_cplt_callback = callback;

  return HAL_OK;
}
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
/**
  * @brief link/store HAL DMA handle into the HAL HASH handle.
  * @param hhash   Pointer to a hal_hash_handle_t structure.
  * @param hdma_in Pointer to a hal_dma_handle_t.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Operation completed.
  */
hal_status_t HAL_HASH_SetInDMA(hal_hash_handle_t *hhash, hal_dma_handle_t *hdma_in)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(hdma_in != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_INIT | (uint32_t)HAL_HASH_STATE_CONFIGURED
                   | (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hdma_in == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */
  hhash->hdma_in = hdma_in;
  hdma_in->p_parent = hhash;

  return HAL_OK;
}
#endif /*USE_HAL_HASH_DMA*/
/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group8
  * @{
This section provides HASH suspend and resume functions.
- Use the function HAL_HASH_RequestSuspendComputation() to request an IT computation process suspension.
- Use the function HAL_HASH_RequestSuspendUpdate() to request an IT update process suspension.
- Use the function HAL_HASH_ResumeComputation() to resume the low-priority computation process.
- Use the function HAL_HASH_ResumeUpdate() to resume the low-priority update process.
- Use the function HAL_HASH_SaveContext() to save the context of the suspended process to start another
high priority one.
- Use the function HAL_HASH_RestoreContext() to restore the saved context of the low-priority process.

- Note that these APIs are also valid for HMAC operations.
  */
/**
  * @brief Request suspension for hash interrupt mode computation.
  * @param hhash   Pointer to a hal_hash_handle_t structure.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_OK            The HASH processing suspension is well requested.
  */
hal_status_t HAL_HASH_RequestSuspendComputation(hal_hash_handle_t *hhash)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_COMPUTE_ACTIVE
                   | (uint32_t)HAL_HASH_HMAC_STATE_COMPUTE_ACTIVE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  /* suspension in DMA mode */
  if (HAL_HASH_IsActiveFlag(hhash, HAL_HASH_FLAG_DMA) != 0U)
  {
    if (HASH_SuspendDMA(hhash) != HAL_OK)
    {
      return HAL_ERROR;
    }
    else
    {
      hhash->previous_state = hhash->global_state;
      hhash->global_state = HAL_HASH_STATE_SUSPENDED;
    }
  }
  else /* suspension when in interruption mode */
  {
#endif /* USE_HAL_HASH_DMA */
    hhash->suspend_request = 1U;
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  }
#endif /* USE_HAL_HASH_DMA */
  return HAL_OK;
}

/**
  * @brief Resumption of the suspended HASH processing computation.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          Process is already ongoing.
  * @retval HAL_ERROR         An error has occurred.
  * @retval HAL_OK            HASH suspended processing is resumed.
  */
hal_status_t HAL_HASH_ResumeComputation(hal_hash_handle_t *hhash)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_STATE(hhash->global_state, HAL_HASH_STATE_SUSPENDED);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hhash, global_state, HAL_HASH_STATE_SUSPENDED, hhash->previous_state);

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  if ((hhash->hdma_in != NULL) && (hhash->dma_operation_active_flag == 1U))
  {
    if (HASH_ResumeDMA(hhash) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  else
  {
#endif /* USE_HAL_HASH_DMA */
    HAL_HASH_EnableIT(hhash, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  }
#endif /* USE_HAL_HASH_DMA */

  return HAL_OK;
}

/**
  * @brief  Request suspension for hash interrupt mode processing update.
  * @param  hhash     Pointer to a hal_hash_handle_t structure.
  * @retval HAL_INVALID_PARAM        Invalid parameter.
  * @retval HAL_ERROR An error has been occurred.
  * @retval HAL_OK    The HASH processing suspension is well requested.
  */
hal_status_t HAL_HASH_RequestSuspendUpdate(hal_hash_handle_t *hhash)
{
  ASSERT_DBG_PARAM(hhash != NULL);

