MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_UPDATE_ACTIVE
                   | (uint32_t)HAL_HASH_HMAC_STATE_UPDATE_ACTIVE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  /* suspension in DMA mode */
  if (HAL_HASH_IsActiveFlag(hhash, HAL_HASH_FLAG_DMA) != 0U)
  {
    if (HASH_SuspendDMA(hhash) != HAL_OK)
    {
      return HAL_ERROR;
    }
    else
    {
      hhash->previous_state = hhash->global_state;
      hhash->global_state = HAL_HASH_STATE_SUSPENDED;
    }
  }
  else /* Suspension in interrupt mode */
  {
#endif /* USE_HAL_HASH_DMA */
    hhash->suspend_request = 1U;
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  }
#endif /* USE_HAL_HASH_DMA */

  return HAL_OK;
}

/**
  * @brief Resumption of the suspended HASH processing update.
  * @param hhash  Pointer to a hal_hash_handle_t structure.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_BUSY          Process is already ongoing.
  * @retval HAL_ERROR         An error has been occurred.
  * @retval HAL_OK            HASH suspended processing is resumed.
  */
hal_status_t HAL_HASH_ResumeUpdate(hal_hash_handle_t *hhash)
{
  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_STATE(hhash->global_state, HAL_HASH_STATE_SUSPENDED);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hhash == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hhash, global_state, HAL_HASH_STATE_SUSPENDED, hhash->previous_state);

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  if ((hhash->hdma_in != NULL) && (hhash->dma_operation_active_flag == 1U))
  {
    if (HASH_ResumeDMA(hhash) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  else
  {
#endif /* USE_HAL_HASH_DMA */
    HAL_HASH_EnableIT(hhash, HAL_HASH_IT_DIN);
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  }
#endif /* USE_HAL_HASH_DMA */
  return HAL_OK;
}

/**
  * @brief Save parameters of the suspended HASH processing.
  * @param hhash     Pointer to a hal_hash_handle_t structure.
  * @param p_context Pointer to a hal_hash_suspended_context_t structure where to store the parameters of the suspend
  *                  HASH processing.
  */
void HAL_HASH_SaveContext(hal_hash_handle_t *hhash, hal_hash_suspended_context_t *p_context)
{
  uint32_t csr_ptr;
  uint32_t csr_count = 0;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_context != NULL);

  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_SUSPENDED);

  const HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  uint8_t is_hash_compute_active = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_COMPUTE_ACTIVE);
  uint8_t is_hash_update_active = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_UPDATE_ACTIVE);

  csr_ptr = (uint32_t)(hash_instance->CSR);

  STM32_UNUSED(hhash);

  p_context->imr_reg = STM32_READ_BIT(hash_instance->IMR, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);
  p_context->str_reg = STM32_READ_BIT(hash_instance->STR, HASH_STR_NBLW);
  p_context->cr_reg = STM32_READ_BIT(hash_instance->CR, HASH_CR_DMAE | HASH_CR_DATATYPE | HASH_CR_MODE |
                                     HASH_CR_ALGO | HASH_CR_LKEY | HASH_CR_MDMAT);

  hal_hash_algo_t algorithm = (hal_hash_algo_t)(uint32_t)STM32_READ_BIT(hash_instance->CR, HASH_CR_ALGO);
  uint8_t mode = (uint8_t)STM32_READ_BIT(hash_instance->CR, HASH_CR_MODE);

  switch (algorithm)
  {
    case HAL_HASH_ALGO_SHA1:
    case HAL_HASH_ALGO_SHA256:
      csr_count = (mode == 0U) ? HASH_SHA1_SHA2256_CSR_REGISTER_NUMBER : HASH_HMAC_SHA1_SHA2256_CSR_REGISTER_NUMBER;
      break;
#if defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3)
    case HAL_HASH_ALGO_SHA384:
    case HAL_HASH_ALGO_SHA512:
      csr_count = (mode == 0U) ? HASH_SHA2384_SHA2512_CSR_REGISTER_NUMBER :
                  HASH_HMAC_SHA2384_SHA2512_CSR_REGISTER_NUMBER;
      break;
#endif /* HASH_CR_ALGO_2 | HASH_CR_ALGO_3 */
    default:
      csr_count = HASH_CSR_REGISTERS_NUMBER;
      break;
  }

  /* Save all CSRs registers */
  for (uint32_t idx = 0U; idx < csr_count; idx++)
  {
    p_context->csr_reg[idx] = *(uint32_t *)csr_ptr;
    csr_ptr += HASH_WORD_SIZE_BYTE;
  }

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  p_context->hdma_in                 = hhash->hdma_in;
#endif /* USE_HAL_HASH_DMA */
  p_context->input_data_count_byte   = hhash->input_data_count_byte;
  p_context->input_size_byte         = hhash->input_size_byte;
  p_context->output_size_byte        = hhash->output_size_byte;
  p_context->digest_size_byte        = hhash->digest_size_byte;
  p_context->key_size_byte           = hhash->key_size_byte;
  p_context->phase                   = hhash->phase;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  p_context->p_abort_cplt_callback   = hhash->p_abort_cplt_callback;
  p_context->p_digest_cplt_callback  = hhash->p_digest_cplt_callback;
  p_context->p_error_callback        = hhash->p_error_callback;
  p_context->p_input_buff            = hhash->p_input_buff;
  p_context->p_output_buff           = hhash->p_output_buff;
  p_context->p_input_cplt_callback   = hhash->p_input_cplt_callback;
  p_context->p_suspend_cplt_callback = hhash->p_suspend_cplt_callback;
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
  p_context->p_hmac_key_buff         = hhash->p_hmac_key_buff;
  p_context->p_hmac_key_saved        = hhash->p_hmac_key_saved;
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  p_context->dma_operation_active_flag = hhash->dma_operation_active_flag;
#endif /* USE_HAL_HASH_DMA */
  p_context->previous_state           = hhash->global_state;

  hhash->global_state = ((is_hash_compute_active == 1U) || (is_hash_update_active == 1U))
                        ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
}

/**
  * @brief Restore the HASH context in case of processing resumption.
  * @param hhash     Pointer to a hal_hash_handle_t structure.
  * @param p_context Pointer to a hal_hash_suspended_context_t structure where to store the parameters of the suspend
  *                  HASH processing.
  */
void HAL_HASH_RestoreContext(hal_hash_handle_t *hhash, const hal_hash_suspended_context_t *p_context)
{
  uint32_t csr_ptr;
  uint32_t csr_count = 0U;

  ASSERT_DBG_PARAM(hhash != NULL);
  ASSERT_DBG_PARAM(p_context != NULL);
  ASSERT_DBG_PARAM(p_context->previous_state == HAL_HASH_STATE_SUSPENDED);

