MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  ASSERT_DBG_STATE(hhash->global_state, (uint32_t)HAL_HASH_STATE_CONFIGURED | (uint32_t)HAL_HASH_HMAC_STATE_CONFIGURED);

  STM32_UNUSED(hhash);
  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  csr_ptr = (uint32_t)(hash_instance->CSR);

  STM32_WRITE_REG(hash_instance->IMR, p_context->imr_reg);
  STM32_WRITE_REG(hash_instance->STR, p_context->str_reg);
  STM32_WRITE_REG(hash_instance->CR, p_context->cr_reg);

  STM32_SET_BIT(hash_instance->CR, HASH_CR_INIT);

  hal_hash_algo_t algorithm = (hal_hash_algo_t)(uint32_t)STM32_READ_BIT(hash_instance->CR, HASH_CR_ALGO);
  uint8_t mode = (uint8_t)STM32_READ_BIT(hash_instance->CR, HASH_CR_MODE);

  switch (algorithm)
  {
    case HAL_HASH_ALGO_SHA1:
    case HAL_HASH_ALGO_SHA256:
      csr_count = (mode == 0U) ? HASH_SHA1_SHA2256_CSR_REGISTER_NUMBER : HASH_HMAC_SHA1_SHA2256_CSR_REGISTER_NUMBER;
      break;
#if defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3)
    case HAL_HASH_ALGO_SHA384:
    case HAL_HASH_ALGO_SHA512:
      csr_count = (mode == 0U) ? HASH_SHA2384_SHA2512_CSR_REGISTER_NUMBER :
                  HASH_HMAC_SHA2384_SHA2512_CSR_REGISTER_NUMBER;
      break;
#endif /* HASH_CR_ALGO_2 | HASH_CR_ALGO_3 */
    default:
      csr_count = HASH_CSR_REGISTERS_NUMBER;
      break;
  }

  /* Restore all CSR registers */
  for (uint32_t idx = 0U; idx < csr_count; idx++)
  {
    STM32_WRITE_REG((*(uint32_t *)(csr_ptr)), p_context->csr_reg[idx]);
    csr_ptr += HASH_WORD_SIZE_BYTE;
  }

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  hhash->hdma_in                 = p_context->hdma_in;
#endif /* USE_HAL_HASH_DMA */
  hhash->input_data_count_byte   = p_context->input_data_count_byte;
  hhash->input_size_byte         = p_context->input_size_byte;
  hhash->output_size_byte        = p_context->output_size_byte;
  hhash->digest_size_byte        = p_context->digest_size_byte;
  hhash->key_size_byte           = p_context->key_size_byte;
  hhash->phase                   = p_context->phase;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_abort_cplt_callback   = p_context->p_abort_cplt_callback;
  hhash->p_digest_cplt_callback  = p_context->p_digest_cplt_callback;
  hhash->p_error_callback        = p_context->p_error_callback;
  hhash->p_input_buff            = p_context->p_input_buff;
  hhash->p_output_buff           = p_context->p_output_buff;
  hhash->p_input_cplt_callback   = p_context->p_input_cplt_callback;
  hhash->p_suspend_cplt_callback = p_context->p_suspend_cplt_callback;
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
  hhash->p_hmac_key_buff         = p_context->p_hmac_key_buff;
  hhash->p_hmac_key_saved        = p_context->p_hmac_key_saved;
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
  hhash->dma_operation_active_flag  = p_context->dma_operation_active_flag;
#endif /* USE_HAL_HASH_DMA */

  hhash->global_state = HAL_HASH_STATE_SUSPENDED;
}
/**
  * @}
  */

/** @addtogroup HASH_Exported_Functions_Group9
  * @{
This subsection provides a set of functions to get the HASH error information and state:
- Use the function HAL_HASH_GetState() to get the HASH global state.
- Use the function HAL_HASH_GetLastErrorCodes() to get the last error codes.
- Use the function HAL_HASH_SetUserData() to set the user data.
- Use the function HAL_HASH_GetUserData() to get the user data.
  */

/**
  * @brief Return the HASH handle state.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  * @retval HAL HASH global state.
  */
hal_hash_state_t HAL_HASH_GetState(const hal_hash_handle_t *hhash)
{
  ASSERT_DBG_PARAM(hhash != NULL);

  return hhash->global_state;
}

#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
/**
  * @brief Return the HASH handle error code.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  * @retval HASH last error Codes.
  * @note When the return is 0xAAAAAAAAU this is a HAL_INVALID_PARAM
  */
uint32_t HAL_HASH_GetLastErrorCodes(const hal_hash_handle_t *hhash)
{
  ASSERT_DBG_PARAM(hhash != NULL);

  return hhash->last_error_codes;
}
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */

#if defined (USE_HAL_HASH_USER_DATA) && (USE_HAL_HASH_USER_DATA == 1)
/**
  * @brief Store the user data pointer into the HASH handle.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  * @param p_user_data Pointer to the user data.
  */
void HAL_HASH_SetUserData(hal_hash_handle_t *hhash, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hhash != NULL);

  hhash->p_user_data = p_user_data;
}

/**
  * @brief Retrieve the user data from the HASH handle.
  * @param hhash Pointer to a hal_hash_handle_t structure.
  * @retval Pointer to the user data.
  */
const void *HAL_HASH_GetUserData(const hal_hash_handle_t *hhash)
{
  ASSERT_DBG_PARAM(hhash != NULL);

  return (hhash->p_user_data);
}
#endif /* USE_HAL_HASH_USER_DATA */
/**
  * @}
  */

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @addtogroup HASH_Private_Functions
  * @{
  */
#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
/**
  * @brief DMA HASH Compute Input Data transfer completion callback.
  * @param hdma DMA handle.
  */
static void HASH_ComputeDMAXferCplt(hal_dma_handle_t *hdma)
{
  hal_hash_handle_t *hhash = (hal_hash_handle_t *)(hdma->p_parent);
  uint32_t digest_copy_length = 0U;
  /* Call Input data transfer complete callback */
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_input_cplt_callback(hhash);
#else
  HAL_HASH_InputCpltCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_DCI, 0U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    hhash->phase        = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_STATE_CONFIGURED;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
    hhash->p_error_callback(hhash);
#else
    HAL_HASH_ErrorCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
    return;
  }

  digest_copy_length = (hhash->output_size_byte > hhash->block_size_byte)
                       ? hhash->block_size_byte : hhash->output_size_byte;
  HASH_GetDigestMsg(hhash, hhash->p_output_buff, (uint8_t)digest_copy_length);


