MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  hhash->phase = HASH_PHASE_READY;
  hhash->dma_operation_active_flag = 0U;
  hhash->global_state              = HAL_HASH_STATE_CONFIGURED;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_digest_cplt_callback(hhash);
#else
  HAL_HASH_DigestCpltCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
}

/**
  * @brief DMA HASH HMAC Compute Input Data transfer completion callback.
  * @param hdma DMA handle.
  */
static void HASH_HMAC_ComputeDMAXferCplt(hal_dma_handle_t *hdma)
{
  hal_hash_handle_t *hhash = (hal_hash_handle_t *)(hdma->p_parent);
  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  uint32_t digest_copy_length = 0U;

  /* Call Input data transfer complete callback */
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_input_cplt_callback(hhash);
#else
  HAL_HASH_InputCpltCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */

  hhash->phase = HASH_PHASE_HMAC_OUTER_KEY_ENTRY;
  /* Configure the number of valid bits in last word of the Key */
  STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 8U * ((hhash->key_size_byte) % HASH_WORD_SIZE_BYTE));
  HASH_WriteKey(hhash, hhash->p_hmac_key_saved, hhash->key_size_byte);

  /* Start the Key padding then the Digest calculation */
  STM32_SET_BIT(hash_instance->STR, HASH_STR_DCAL);

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_DCI, 0U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    hhash->phase        = HASH_PHASE_READY;
    hhash->global_state = HAL_HASH_HMAC_STATE_CONFIGURED;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
    hhash->p_error_callback(hhash);
#else
    HAL_HASH_ErrorCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
    return;
  }

  digest_copy_length = (hhash->output_size_byte < hhash->digest_size_byte) ? hhash->output_size_byte :
                       hhash->digest_size_byte;
  HASH_GetDigestMsg(hhash, hhash->p_output_buff, (uint8_t)digest_copy_length);
  hhash->phase                    = HASH_PHASE_READY;
  hhash->global_state             = HAL_HASH_HMAC_STATE_CONFIGURED;

#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_digest_cplt_callback(hhash);
#else
  HAL_HASH_DigestCpltCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
}

/**
  * @brief DMA HASH Update Input Data transfer completion callback.
  * @param hdma DMA handle.
  */
static void HASH_UpdateDMAXferCplt(hal_dma_handle_t *hdma)
{
  hal_hash_handle_t *hhash = (hal_hash_handle_t *)(hdma->p_parent);

  /**
    * Keep the global state to HAL_HASH_STATE_UPDATE_ACTIVE as up to HAL_HASH_Finish() to set
    * the state bck to HAL_HASH_STATE_CONFIGURED
    */
  hhash->global_state = HAL_HASH_STATE_UPDATE_ACTIVE;

#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_input_cplt_callback(hhash);
#else
  HAL_HASH_InputCpltCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
}

/**
  * @brief DMA HASH HMAC Update Input Data transfer completion callback.
  * @param hdma DMA handle.
  */
static void HASH_HMAC_UpdateDMAXferCplt(hal_dma_handle_t *hdma)
{
  hal_hash_handle_t *hhash = (hal_hash_handle_t *)(hdma->p_parent);

  /**
    * Keep the global state to HAL_HASH_HMAC_STATE_UPDATE_ACTIVE as up to HAL_HASH_HMAC_Finish() to set
    * the state bck to HAL_HASH_HMAC_STATE_CONFIGURED
    */
  hhash->global_state = HAL_HASH_HMAC_STATE_UPDATE_ACTIVE;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_input_cplt_callback(hhash);
#else
  HAL_HASH_InputCpltCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
}

/**
  * @brief DMA HASH Abort callback.
  * @param hdma DMA handle.
  */
static void HASH_DMAAbort(hal_dma_handle_t *hdma)
{
  hal_hash_handle_t *hhash = (hal_hash_handle_t *)((hal_dma_handle_t *)hdma)->p_parent;
  uint8_t is_hash_compute_active = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_COMPUTE_ACTIVE);
  uint8_t is_hash_update_active = (uint8_t)(hhash->previous_state == HAL_HASH_STATE_UPDATE_ACTIVE);

  STM32_SET_BIT(HASH_GET_INSTANCE(hhash)->CR, HASH_CR_INIT);
  hhash->input_data_count_byte = 0U;
  hhash->input_size_byte = 0U;
  hhash->suspend_request = 0U;
  hhash->phase           = HASH_PHASE_READY;
  hhash->global_state = ((is_hash_compute_active == 1U) || (is_hash_update_active == 1U))
                        ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_abort_cplt_callback(hhash);
#else
  HAL_HASH_AbortCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
}

/**
  * @brief DMA HASH communication error callback.
  * @param hdma DMA handle.
  */
static void HASH_DMAError(hal_dma_handle_t *hdma)
{
  hal_hash_handle_t *hhash = (hal_hash_handle_t *)(hdma->p_parent);
  uint8_t is_hash_compute_active = (uint8_t)(hhash->global_state == HAL_HASH_STATE_COMPUTE_ACTIVE);
  uint8_t is_hash_update_active = (uint8_t)(hhash->global_state == HAL_HASH_STATE_UPDATE_ACTIVE);

#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
  hhash->last_error_codes |= HAL_HASH_ERROR_DMA;
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */

  hhash->global_state = ((is_hash_compute_active == 1U) || (is_hash_update_active == 1U))
                        ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
#if defined (USE_HAL_HASH_REGISTER_CALLBACKS) && (USE_HAL_HASH_REGISTER_CALLBACKS == 1)
  hhash->p_error_callback(hhash);
#else
  HAL_HASH_ErrorCallback(hhash);
#endif /* USE_HAL_HASH_REGISTER_CALLBACKS */
}
#endif /* USE_HAL_HASH_DMA */

/**
  * @brief Feed the input key buffer to the HASH peripheral in polling.
  * @param hhash         Pointer to a hal_hash_handle_t structure.
  * @param p_key         Pointer to input buffer.
  * @param key_size_byte Specifies the size of input buffer in bytes.
  */
static void HASH_WriteKey(hal_hash_handle_t *hhash, const uint8_t *p_key, uint32_t key_size_byte)
{
  uint32_t buffer_counter;
  volatile uint32_t inputaddr = (uint32_t) p_key;
  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

