MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  for (buffer_counter = 0U; buffer_counter < (key_size_byte / HASH_WORD_SIZE_BYTE); buffer_counter++)
  {
    /* Write input data 4 bytes at a time */
    hash_instance->DIN = *(uint32_t *)inputaddr;
    inputaddr += 4U;
    hhash->input_data_count_byte += 4U;
  }

  if ((key_size_byte % HASH_WORD_SIZE_BYTE) != 0U)
  {
    HASH_WriteRemainingByte(hhash, (uint8_t *)inputaddr, key_size_byte);
  }
}

/**
  * @brief Retrieve the message digest.
  * @param hhash Pointer to a HASH handle structure.
  * @param p_msg_digest Pointer to the computed digest.
  * @param input_size_byte message digest size in bytes.
  */
static void HASH_GetDigestMsg(const hal_hash_handle_t *hhash, uint8_t *p_msg_digest, uint8_t input_size_byte)
{
  uint32_t i;
  uint8_t tmp_input_size_byte = input_size_byte;

  if (tmp_input_size_byte > hhash->digest_size_byte)
  {
    tmp_input_size_byte = (uint8_t)hhash->digest_size_byte;
  }
  uint32_t input_size_word = ((uint32_t)tmp_input_size_byte) >> 2U;
  const HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  for (i = 0U; i < input_size_word; i++)
  {
    uint32_t val = __REV(hash_instance->HR[i]);
    p_msg_digest[(i * 4U) + 0U] = (uint8_t)(val & 0xFFU);
    p_msg_digest[(i * 4U) + 1U] = (uint8_t)((val >> 8U) & 0xFFU);
    p_msg_digest[(i * 4U) + 2U] = (uint8_t)((val >> 16U) & 0xFFU);
    p_msg_digest[(i * 4U) + 3U] = (uint8_t)((val >> 24U) & 0xFFU);
  }
}

/**
  * @brief Handle HASH processing timeout.
  * @param hhash        Pointer to a HASH handle structure.
  * @param timeout_ms   Specify timeout value in millisecond.
  * @param tick_start   Specify HAL tick start value in milliseconds.
  * @retval HAL_TIMEOUT A timeout has occurred.
  * @retval HAL_OK      Operation completed.
  */
static hal_status_t HASH_WaitUntilTimeout(hal_hash_handle_t *hhash, uint32_t timeout_ms, uint32_t tick_start)
{
  STM32_UNUSED(hhash);

  /* Check for the timeout */
  if (timeout_ms != HAL_MAX_DELAY)
  {
    if (((HAL_GetTick() - tick_start) > timeout_ms) || (timeout_ms == 0U))
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @brief Set HASH HMAC mode.
  * @param hhash          Pointer to a HASH handle structure.
  * @param key_size_bytes Specifies the key size in bytes.
  */
static void HASH_SetHMACMode(const hal_hash_handle_t *hhash, uint32_t key_size_bytes)
{
  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  uint32_t cr_value = HASH_CR_MODE | HASH_CR_INIT;

  if (key_size_bytes  > hhash->block_size_byte)
  {
    cr_value |= HASH_CR_LKEY;
  }

  STM32_MODIFY_REG(hash_instance->CR, HASH_CR_LKEY | HASH_CR_MODE | HASH_CR_INIT, cr_value);
}

#if defined (USE_HAL_HASH_DMA) && (USE_HAL_HASH_DMA == 1)
/** @brief suspend the DMA.
  * @param hhash specifies the HASH handle.
  * @retval HAL_TIMEOUT A timeout has occurred.
  * @retval HAL_ERROR   An error has been occurred.
  * @retval HAL_OK      DMA suspended.
  */
static hal_status_t HASH_SuspendDMA(hal_hash_handle_t *hhash)
{
  uint32_t remaining_words; /* remaining number in of source block to be transferred. */
  uint32_t size_in_words;   /* number in word of source block to be transferred.*/

  /* Clear the DMAE bit to disable the DMA interface */
  STM32_CLEAR_BIT(HASH_GET_INSTANCE(hhash)->CR, HASH_CR_DMAE);

  /* Wait until the last DMA transfer is complete (DMAS = 0 in the HASH_SR register) */
  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_DMA, 1U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  /* At this point, DMA interface is disabled and no transfer is on-going */
  /* Retrieve from the DMA handle how many words remain to be written */
  /* DMA3 used, DMA_CBR1_BNDT in bytes, DMA_CSR_FIFOL in words */
  remaining_words = ((((DMA_Channel_TypeDef *)hhash->hdma_in->instance)->CBR1) & DMA_CBR1_BNDT) / HASH_WORD_SIZE_BYTE;
#if defined (DMA_CSR_FIFOL)
  remaining_words += (((((DMA_Channel_TypeDef *)hhash->hdma_in->instance)->CSR) & DMA_CSR_FIFOL) >> DMA_CSR_FIFOL_Pos) /
                     HASH_WORD_SIZE_BYTE;
#endif /* DMA_CSR_FIFOL */
  /* Disable DMA channel */
  /* Note that the Abort function will
    - Clear the transfer error flags
    - Unlock
    - Set the State
    */
  if (HAL_DMA_Abort(hhash->hdma_in) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Wait until the hash processor is ready (no block is being processed), that is wait for DINIS=1 in HASH_SR */
  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_DINI, 0U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  if (HAL_HASH_IsActiveFlag(hhash, HAL_HASH_FLAG_DCI) != 0U)
  {
    return HAL_ERROR;
  }

  if (remaining_words == 0U)
  {
    /* All the DMA transfer is actually done. Suspension occurred at the very end
    of the transfer. Either the digest computation is about to start (HASH case)
    or processing is about to move from one step to another (HMAC case).
    In both cases, the processing can't be suspended at this point. It is
    safer to
    - retrieve the low priority block digest before starting the high
    priority block processing (HASH case)
    - re-attempt a new suspension (HMAC case)
    */
    return HAL_ERROR;
  }
  else
  {
    /* Compute how many words were supposed to be transferred by DMA */
    size_in_words = ((hhash->input_size_byte + 3U) / HASH_WORD_SIZE_BYTE);

    /* Accordingly, update the input pointer that points at the next word to be transferred to the Peripheral by DMA */
    hhash->p_input_buff += HASH_WORD_SIZE_BYTE * (size_in_words - remaining_words);

    /* And store in input_data_count_byte the remaining size to transfer (in bytes) */
    hhash->input_size_byte = HASH_WORD_SIZE_BYTE * remaining_words;

    return HAL_OK;
  }
}

/** @brief Resume the DMA.
  * @param hhash Pointer to a HASH handle structure.
  * @retval HAL_TIMEOUT A timeout has occurred.
  * @retval HAL_ERROR   An error has been occurred.
  * @retval HAL_OK      DMA resumed.
  */
static hal_status_t HASH_ResumeDMA(hal_hash_handle_t *hhash)
{
  uint32_t tmp_input_size;
  uint8_t is_hash_compute_active = (uint8_t)(hhash->global_state == HAL_HASH_STATE_COMPUTE_ACTIVE);
  uint8_t is_hash_update_active  = (uint8_t)(hhash->global_state == HAL_HASH_STATE_UPDATE_ACTIVE);

  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);
  STM32_MODIFY_REG(hash_instance->STR, HASH_STR_NBLW, 0U);

