MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  tmp_input_size = (hhash->input_size_byte + (HASH_WORD_SIZE_BYTE  - 1U)) & ~(HASH_WORD_SIZE_BYTE  - 1U);

  STM32_SET_BIT(hash_instance->CR, HASH_CR_DMAE);

  if (HAL_DMA_StartPeriphXfer_IT_Opt(hhash->hdma_in,
                                     (uint32_t)hhash->p_input_buff,
                                     (uint32_t) &((HASH_TypeDef *)((uint32_t)(hhash)->instance))->DIN,
                                     tmp_input_size,
                                     HAL_DMA_OPT_IT_NONE) != HAL_OK)
  {
    hhash->phase           = HASH_PHASE_READY;
    hhash->global_state    = ((is_hash_compute_active == 1U) || (is_hash_update_active == 1U))
                             ? HAL_HASH_STATE_CONFIGURED : HAL_HASH_HMAC_STATE_CONFIGURED;
#if defined(USE_HAL_HASH_GET_LAST_ERRORS) && (USE_HAL_HASH_GET_LAST_ERRORS == 1)
    hhash->last_error_codes |= HAL_HASH_ERROR_DMA;
#endif /* USE_HAL_HASH_GET_LAST_ERRORS */

    return HAL_ERROR;
  }

  return HAL_OK;
}
#endif /* USE_HAL_HASH_DMA */

/** @brief Get the digest length in byte.
  * @param algorithm specifies the HASH algorithm.
  * @retval digest length.
  */
static uint32_t HASH_GetDigestLength(hal_hash_algo_t algorithm)
{
  /* Digest size lookup table for normalized algorithm index */
  static const uint8_t hash_digest_size_lut[16U] =
  {
    /* 0b0000 */ HAL_DIGEST_SIZE_20B,    /* 0: SHA1         */

    /* 0b0001 */ 0U,                     /* 1: unsupported  */

    /* 0b0010 */ HAL_DIGEST_SIZE_28B,    /* 2: SHA224       */

    /* 0b0011 */ HAL_DIGEST_SIZE_32B,    /* 3: SHA256       */

    /* 0b0100 */ 0U,                     /* 4: unsupported  */

    /* 0b0101 */ 0U,                     /* 5: unsupported  */

    /* 0b0110 */ 0U,                     /* 6: unsupported  */

    /* 0b0111 */ 0U,                     /* 7: unsupported  */

    /* 0b1000 */ 0U,                     /* 8: unsupported  */

    /* 0b1001 */ 0U,                     /* 9: unsupported  */

    /* 0b1010 */ 0U,                     /* 10: unsupported */

    /* 0b1011 */ 0U,                     /* 11: unsupported */

#if defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3)
    /* 0b1100 */ HAL_DIGEST_SIZE_48B,    /* 12: SHA384      */
#endif /* HASH_CR_ALGO_2 | HASH_CR_ALGO_3 */

    /* 0b1101 */ HAL_DIGEST_SIZE_28B,    /* 13: SHA512224   */

    /* 0b1110 */ HAL_DIGEST_SIZE_32B,    /* 14: SHA512256   */

#if defined(HASH_CR_ALGO_0) && defined(HASH_CR_ALGO_1) && defined(HASH_CR_ALGO_2) && defined(HASH_CR_ALGO_3)
    /* 0b1111 */ HAL_DIGEST_SIZE_64B     /* 15: SHA512      */
#endif /* HASH_CR_ALGO_0 | HASH_CR_ALGO_1 | HASH_CR_ALGO_2 | HASH_CR_ALGO_3 */
  };

  uint32_t index = ((uint32_t)algorithm & HASH_CR_ALGO) >> HASH_CR_ALGO_Pos;

  return (uint32_t)hash_digest_size_lut[index];
}

/**
  * @brief Feed the remaining byte to HASH DIN register then the padding is done automatically using
  *        the information provided in NBLW.
  * @param hhash             Pointer to a hal_hash_handle_t structure.
  * @param p_in_buff         Pointer to input buffer.
  * @param input_size_bytes  The number of bytes within the last block
  */
static void HASH_WriteRemainingByte(hal_hash_handle_t *hhash, const uint8_t *p_in_buff, uint32_t input_size_bytes)
{
  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  hash_instance->DIN = *(uint32_t *)((uint32_t)p_in_buff);
  hhash->input_data_count_byte += input_size_bytes % HASH_WORD_SIZE_BYTE;
}

/**
  * @brief Process One block of data in polling mode.
  * @param hhash      Pointer to a hal_hash_handle_t structure.
  */
static void HASH_WriteBlock(hal_hash_handle_t *hhash)
{
  volatile uint32_t inputaddr = (uint32_t)hhash->p_input_buff;
  uint32_t buffer_counter = 0U;

  for (; buffer_counter < hhash->block_size_byte; buffer_counter += 4U)
  {
    /* Write input data 4 bytes at a time */
    HASH_GET_INSTANCE(hhash)->DIN = *(uint32_t *)inputaddr;
    inputaddr += 4U;
    hhash->p_input_buff += 4U;
    hhash->input_data_count_byte += 4U;
  }
}

/**
  * @brief Process One block of data in IT mode.
  * @param hhash      Pointer to a hal_hash_handle_t structure.
  * @retval HAL_ERROR An error has been occurred.
  * @retval HAL_OK    Operation completed.
  */
static hal_status_t HASH_WriteBlock_IT(hal_hash_handle_t *hhash)
{
  HASH_TypeDef *hash_instance = HASH_GET_INSTANCE(hhash);

  volatile uint32_t inputaddr = (uint32_t)hhash->p_input_buff;

  /* Number of bytes to enter in HASH FIFO to trigger partial HASH */
  uint32_t NbrOfWordsExpected = (((STM32_READ_REG(hash_instance->SR) >> HASH_SR_NBWE_Pos)) << 2U);

  for (uint32_t buffer_counter = 0U; buffer_counter < NbrOfWordsExpected; buffer_counter += 4U)
  {
    if (hhash->input_data_count_byte == (hhash->input_size_byte - (hhash->input_size_byte % 4U)))
    {
      break;
    }
    /* Write input data 4 bytes at a time */
    hash_instance->DIN = *(uint32_t *)inputaddr;
    inputaddr += 4U;
    hhash->p_input_buff += 4U;
    hhash->input_data_count_byte += 4U;
  }

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_BUSY, 1U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    HAL_HASH_DisableIT(hhash, HAL_HASH_IT_DIN);
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief Write Last block (remaining valid words less than to block size or remaining bytes) to HASH_DIN register.
  * @param hhash      Pointer to a HASH handle structure.
  * @retval HAL_ERROR An error has been occurred.
  * @retval HAL_OK    Operation completed.
  */
static hal_status_t HASH_WriteLastBlock(hal_hash_handle_t *hhash)
{
  uint32_t remaining_words_nbr = (hhash->input_size_byte - hhash->input_data_count_byte) / HASH_WORD_SIZE_BYTE;
  uint32_t remaining_bytes_nbr = (hhash->input_size_byte - hhash->input_data_count_byte) % HASH_WORD_SIZE_BYTE;
  if (remaining_words_nbr != 0U)
  {
    if (HASH_WriteIncompleteBlock(hhash, remaining_words_nbr) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  if (remaining_bytes_nbr != 0U)
  {
    HASH_WriteRemainingByte(hhash, hhash->p_input_buff, remaining_bytes_nbr);
  }

  return HAL_OK;
}

/**
  * @brief Feed the remaining words for the incompleted block to the HASH_DIN register.
  * @param hhash               Pointer to a hal_hash_handle_t structure.
  * @param remaining_words_nbr Number of remaining word to write to HASH_DIN register.
  * @retval HAL_TIMEOUT HASH digest computation exceeds timeout
  * @retval HAL_OK      HASH digest computation is completed
  */
static hal_status_t HASH_WriteIncompleteBlock(hal_hash_handle_t *hhash, uint32_t remaining_words_nbr)
{
  volatile uint32_t inputaddr = (uint32_t)hhash->p_input_buff;

  for (uint32_t index = 0U; index < remaining_words_nbr; index++)
  {
    /* Write input data 4 bytes at a time */
    HASH_GET_INSTANCE(hhash)->DIN = (*(uint32_t *)inputaddr);
    inputaddr += 4U;
    hhash->p_input_buff += 4U;
    hhash->input_data_count_byte += 4U;
  }

  if (HASH_WaitOnFlag(hhash, HAL_HASH_FLAG_BUSY, 1U, HASH_MAX_BLOCK_PROCESS_CYCLE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Handle HASH hardware block timeout when waiting for a flag to be raised.
  * @param hhash        Pointer to a HASH handle structure.
  * @param flag         Specifies the HASH flag to check.
  * @param flag_state   The Flag status (SET or RESET).
  * @param wait_cycles  Specify wait cycles value in millisecond.
  * @retval HAL_ERROR   An error has been occurred.
  * @retval HAL_OK      Operation completed.
  */
static hal_status_t HASH_WaitOnFlag(hal_hash_handle_t *hhash, uint32_t flag, uint32_t flag_state,
                                    uint32_t wait_cycles)
{
  uint32_t count = wait_cycles;

  /* Simple polling loop with cycle counter, approximate CPU cycles with iterations */
  while ((HAL_HASH_IsActiveFlag(hhash, flag) == flag_state) && (count > 0U))
  {
    count--;
  }

