MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_hash.c
  if (count == 0U)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief Saves the remaining bytes (less than a word) from the input buffer.
  * @param hhash            Pointer to a HASH handle structure.
  * @param remain_bytes_nbr remain bytes number to be saved for next HASH/HMAC update or finish operation.
  */
static void HASH_SaveRemainingBytes(hal_hash_handle_t *hhash, uint32_t remain_bytes_nbr)
{
  hhash->remain_bytes_number = (uint8_t)(remain_bytes_nbr % HASH_WORD_SIZE_BYTE);
  /* Save remaining bytes */
  for (uint32_t i = 0U; i < hhash->remain_bytes_number; i++)
  {
    hhash->remain_bytes[i] = *(const uint8_t *)(hhash->p_input_buff + i);
  }
}

/**
  * @brief Append and processes the last incomplete word from the current input buffer.
  * @param hhash Pointer to a HASH handle structure.
  * @note This function combines any remaining bytes with the next bytes in the buffer to form a complete word
  */
static void HASH_AppendLastIncompleteWord(hal_hash_handle_t *hhash)
{
  /* Process additional bytes */
  uint32_t tmp = 0U;
  for (uint32_t i = 0U; i < hhash->remain_bytes_number; i++)
  {
    tmp |= ((uint32_t)hhash->remain_bytes[i] << ((uint32_t)(i * 8U)));
  }

  /* Process the first bytes of the buffer to complete the 4 bytes */
  for (uint32_t i = 0U; (i < (4U - (uint32_t)hhash->remain_bytes_number)) && (i < hhash->input_size_byte); i++)
  {
    tmp |= (*(uint32_t *)(uint32_t)hhash->p_input_buff) << ((i + (uint32_t)hhash->remain_bytes_number) * 8U);
    hhash->p_input_buff += 1U;
  }
  HASH_GET_INSTANCE(hhash)->DIN = tmp;

  /* Adjust buffer size after processing first bytes */
  hhash->input_size_byte -= (hhash->input_size_byte > (4U - (uint32_t)hhash->remain_bytes_number)) ?
                            (4U - (uint32_t)hhash->remain_bytes_number) : hhash->input_size_byte;
  hhash->remain_bytes_number = 0U;
}

/**
  * @brief HASH/HMAC process Data in IT mode: Each Block write to HASH_DIN, then Write the last incomplete block.
  * @param hhash Pointer to a HASH handle structure.
  * @retval HAL_ERROR An error has been occurred.
  * @retval HAL_OK    Operation completed.
  */
static hal_status_t HASH_HMAC_ComputeProcessData_IT(hal_hash_handle_t *hhash)
{
  uint32_t uncompleted_last_block;

  if ((hhash->input_size_byte - hhash->input_data_count_byte) >= hhash->block_size_byte)
  {
    if (HASH_WriteBlock_IT(hhash) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  uncompleted_last_block = (hhash->input_size_byte - hhash->input_data_count_byte) / HASH_WORD_SIZE_BYTE;
  if (uncompleted_last_block < (hhash->block_size_byte / HASH_WORD_SIZE_BYTE))
  {
    if (HASH_WriteLastBlock(hhash) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  if ((hhash->phase == HASH_PHASE_HMAC_MESSAGE_ENTRY) && (hhash->input_size_byte == hhash->input_data_count_byte))
  {
    HASH_HMAC_SwitchToStep3(hhash);
  }

  return HAL_OK;
}

/**
  * @brief Handles HASH/HMAC update phase in interrupt mode.
  *        This function processes input data during the update phase for both
  *        HASH and HMAC operations when called from an interrupt context. It:
  *        - Writes full data blocks using HASH_WriteBlock_IT()
  *        - Handles the last incomplete block (if any)
  *        - Saves remaining bytes for later processing
  * @param hhash Pointer to a HASH handle structure.
  * @retval HAL_ERROR An error has been occurred.
  * @retval HAL_OK    Operation completed.
  */
static hal_status_t HASH_HMAC_UpdateProcessData_IT(hal_hash_handle_t *hhash)
{
  uint32_t remaining_words_nbr;

  if ((hhash->input_size_byte - hhash->input_data_count_byte) >= hhash->block_size_byte)
  {
    if (HASH_WriteBlock_IT(hhash) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }
  else /* Still remaining words: Last block less than to block size length */
  {
    hhash->remain_bytes_number = (uint8_t)(hhash->input_size_byte - hhash->input_data_count_byte);
    if (hhash->remain_bytes_number != 0U)
    {
      remaining_words_nbr = (uint32_t)hhash->remain_bytes_number / HASH_WORD_SIZE_BYTE;

      if (remaining_words_nbr != 0U)
      {
        if (HASH_WriteIncompleteBlock(hhash, remaining_words_nbr) != HAL_OK)
        {
          return HAL_ERROR;
        }
      }

      HASH_SaveRemainingBytes(hhash, hhash->remain_bytes_number);
    }

    HAL_HASH_DisableIT(hhash, HAL_HASH_IT_DIN | HAL_HASH_IT_DC);
  }

  return HAL_OK;
}

/**
  * @brief  Switch HMAC processing from STEP 2 to STEP 3.
  *         It finalizes padding of the inner hash and reconfigures
  *         the context to process the HMAC key (outer hash).
  * @param  hhash Pointer to a HASH handle structure.
  */
static void HASH_HMAC_SwitchToStep3(hal_hash_handle_t *hhash)
{
  /* Start the message padding then the Digest calculation */
  STM32_SET_BIT(HASH_GET_INSTANCE(hhash)->STR, HASH_STR_DCAL);

  STM32_MODIFY_REG(HASH_GET_INSTANCE(hhash)->STR, HASH_STR_NBLW,
                   8U * ((hhash->key_size_byte) % HASH_WORD_SIZE_BYTE));

  hhash->p_input_buff          = hhash->p_hmac_key_buff;
  hhash->input_size_byte       = hhash->key_size_byte;
  hhash->input_data_count_byte = 0U;
  hhash->phase                 = HASH_PHASE_HMAC_OUTER_KEY_ENTRY;
}
/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_HAL_HASH_MODULE */

#endif /* HASH */
/**
  * @}
  */
